import { Component, OnInit, ViewChild,NgZone } from '@angular/core';
import { CommonService } from './common.service';
import { DataService } from './data.service';
import { ModalService } from './modal.service';
import { Row } from './row.class';
import { RemoveButtonComponent } from './removeButton.component';
import * as XLSX from 'xlsx';
import { DeviceDetectorService } from 'ngx-device-detector';
import { ApiService } from './api.service';
import { strictEqual } from 'assert';
import { RoService } from './ro.service';
import { SelectEditorComponent } from './selectEditor.component';
import { Router, ActivatedRoute, NavigationEnd, NavigationStart} from '@angular/router';
import { StorageService } from'./storage.service';
import { environment } from '../environments/environment';

type AOA = any[][];

@Component({
  selector: 'q-only-grid',
  template: `
  <div class="top-shadow {{deviceInfo.device}}"></div>
  <div [ngStyle]="style">
  <ag-grid-angular
    class="ag-theme-fresh"
    [stopEditingWhenGridLosesFocus]="false"
    [rowData]="rowData"
    [rowClassRules]="rowClassRules"
    [headerHeight]="40"
    [rowHeight]="100"
    [rowDragManaged]="true"
    [animateRows]="true"
    [columnDefs]="columnDefs"
    [enableCellChangeFlash]="true"
    [singleClickEdit]="true"
    [enableColResize]="false"
    [enableSorting]="false"
    [enableFilter]="false"
    [cacheOverflowSize]="70"
    [rowBuffer]="70"
    [localeText]="{noRowsToShow:' '}"
    [context]="context"
    [frameworkComponents]="frameworkComponents"
    (rowDragEnd)="onRowDragEnd($event)"
    (window:resize)="gridResize($event)"
    (bodyScroll)="onTouchmove($event)"
    (gridReady)="onGridReady($event)"
    (cellValueChanged)="onCellValueChanged($event)"
    ></ag-grid-angular>
    </div>
    <div class = red>
    {{text}}<br>
    </div>
    <div *ngIf="storage.buy == 0" class="showtext">
        <span class="showtext1">{{lang=='b5'?'你必須訂購星願小王子遊戲才能輸入更多題目，以及使用匯入及匯出題目功能。了解更多':'You must subscribe Starwish game add-on to enter more questions, and to use import and export question function. Learn more'}}</span>
    </div>
    <div *ngIf="storage.buy != 0 && common.loading ==[]">
        <div [ngClass]="['file-panel', (isMobile?'mobile':'')]">
        <div class="button" (click)="importClick()">{{lang=='b5'?'上傳Excel':'Import Excel'}}</div>
        <input type="file" #fileInput (click)="fileInput.value = null" (change)="pcImport($event)" accept="application/vnd.openxmlformats-officedocument.spreadsheetml.sheet, application/vnd.ms-excel" value="import"/>
        <div class="button" (click)="onExport()">{{lang=='b5'?'匯出Excel':'Export Excel'}}</div>
        </div>
    </div>

    `,
  styleUrls: ['./app.component.scss'],
  encapsulation: 2
})

export class QOnlyGrid {
  public rowData: Row[] = [];
  protected gridApi;
  protected gridColumnApi;
  protected gridOptions;
  public context = { componentParent: this };
  public frameworkComponents = {
    removeButtonComponent: RemoveButtonComponent,
    selectEditorComponent: SelectEditorComponent
  };
  public lang: string;
  style = {
    width: '100%',
    height: '100%',
    flex: '1 1 auto'
};
  @ViewChild('fileInput', {static: false}) fileInput;
  public wrong = 0;
  public check = 0;
  public text;
  public gamelist =[
    {id: "7", name: "小豬餐廳", name_en: "Pig Restaurant"},
    {id: "8", name: "小豬餐廳", name_en: "Pig Restaurant"},
    {id: "9", name: "小豬餐廳", name_en: "Pig Restaurant"},
    {id: "10", name: "漩渦影無蹤(限時開放)", name_en: "Sea Swirl"},
    {id: "11", name: "漩渦影無蹤(限時開放)", name_en: "Sea Swirl"},
    {id: "12", name: "漩渦影無蹤(限時開放)", name_en: "Sea Swirl"},
    {id: "13", name: "北極熊找朋友", name_en: "Polar Bear"},
    {id: "14", name: "北極熊找朋友", name_en: "Polar Bear"},
    {id: "15", name: "北極熊找朋友", name_en: "Polar Bear"},
    {id: "16", name: "海洋探秘", name_en: "Aqua Trail"},
    {id: "17", name: "海洋探秘", name_en: "Aqua Trail"},
    {id: "18", name: "海洋探秘", name_en: "Aqua Trail"},
    {id: "20", name: "時光隧道(限時開放)", name_en: "Time Tunnel"},
    {id: "21", name: "時光隧道(限時開放)", name_en: "Time Tunnel"},
    {id: "22", name: "時光隧道(限時開放)", name_en: "Time Tunnel"},
    {id: "23", name: "字在雲中尋(限時開放)", name_en: "Word in Cloud"},
    {id: "24", name: "字在雲中尋(限時開放)", name_en: "Word in Cloud"},
    {id: "25", name: "字在雲中尋(限時開放)", name_en: "Word in Cloud"},
    {id: "26", name: "詞語激流(限時開放)", name_en: "Vocab Waterfall"},
    {id: "28", name: "字磚噴水池(限時開放)", name_en: "Word Fountain"},
    {id: "29", name: "點蟲蟲", name_en: "Yummy Bugs"},
    {id: "30", name: "點蟲蟲", name_en: "Yummy Bugs"},
    {id: "31", name: "點蟲蟲", name_en: "Yummy Bugs"},
    {id: "36", name: "釣魚求諺(限時開放)", name_en: "Fishing"},
    {id: "39", name: "分柑同部(限時開放)", name_en: "Radical"},
    {id: "41", name: "石魔浮橋(限時開放)", name_en: "Magical Bridge"},
    {id: "42", name: "字形糖果屋(限時開放)", name_en: "character candy"},
    {id: "43", name: "迷圖詠鴨(圖片)(限時開放)", name_en: "Ducky Quiz (image)"},
    {id: "44", name: "迷圖詠鴨(文字)(限時開放)", name_en: "Ducky Quiz"},
    {id: "45", name: "分柑同部(單字)(限時開放)", name_en: "Radical(only character)"},
    {id: "59", name: "石魔浮橋(英文)(限時開放)", name_en: "Magical Bridge(eng)"},
    {id: "68", name: "漩渦影無蹤(圖)(限時開放)", name_en: "Sea Swirl (image)"},
    {id: "69", name: "漩渦影無蹤(圖)(限時開放)", name_en: "Sea Swirl (image)"},
    {id: "70", name: "漩渦影無蹤(圖)(限時開放)", name_en: "Sea Swirl (image)"},
  ];
  public gamename: string;
  public gamename_en: string;
  public deviceInfo = null;
  public isMobile: boolean = true;
  public db_array =    {
    "手":[
       
          "打"
      ,
          "扎"
      ,
          "扒"
      ,
          "扛"
      ,
          "扣"
      ,
          "技"
      ,
          "扶"
      ,
          "抖"
      ,
          "托"
      ,
          "找"
      ,
          "抄"
      ,
          "折"
      ,
          "扳"
      ,
          "扯"
      ,
          "批"
      ,
          "投"
      ,
          "抓"
      ,
          "抒"
      ,
          "扮"
      ,
          "把"
      ,
          "拉"
      ,
          "拓"
      ,
          "拒"
      ,
          "拍"
      ,
          "按"
      ,
          "抬"
      ,
          "抱"
      ,
          "括"
      ,
          "指"
      ,
          "撰"
      ,
          "損"
      ,
          "換"
      ,
          "摸"
      ,
          "搶"
      ,
          "撥"
      ,
          "摺"
      ,
          "握"
      ,
          "撞"
      ,
          "播"
      ,
          "擁"
      ,
          "提"
      ,
          "捧"
      ,
          "排"
      ,
          "操"
      ,
          "拼"
      ,
          "拔"
      
    ]
,
    "扌":[
       
          "打"
      ,
          "扎"
      ,
          "扒"
      ,
          "扛"
      ,
          "扣"
      ,
          "技"
      ,
          "扶"
      ,
          "抖"
      ,
          "托"
      ,
          "找"
      ,
          "抄"
      ,
          "折"
      ,
          "扳"
      ,
          "扯"
      ,
          "批"
      ,
          "投"
      ,
          "抓"
      ,
          "抒"
      ,
          "扮"
      ,
          "把"
      ,
          "拉"
      ,
          "拓"
      ,
          "拒"
      ,
          "拍"
      ,
          "按"
      ,
          "抬"
      ,
          "抱"
      ,
          "括"
      ,
          "指"
      ,
          "撰"
      ,
          "損"
      ,
          "換"
      ,
          "摸"
      ,
          "搶"
      ,
          "撥"
      ,
          "摺"
      ,
          "握"
      ,
          "撞"
      ,
          "播"
      ,
          "擁"
      ,
          "提"
      ,
          "捧"
      ,
          "排"
      ,
          "操"
      ,
          "拼"
      ,
          "拔"
      
    ]
,
    "口":[
       
          "吃"
      ,
          "哈"
      ,
          "吧"
      ,
          "吻"
      ,
          "吵"
      ,
          "味"
      ,
          "咀"
      ,
          "呼"
      ,
          "和"
      ,
          "品"
      ,
          "咽"
      ,
          "員"
      ,
          "哭"
      ,
          "哥"
      ,
          "問"
      ,
          "咳"
      ,
          "啄"
      ,
          "售"
      ,
          "唱"
      ,
          "啡"
      ,
          "啤"
      ,
          "單"
      ,
          "唾"
      ,
          "喉"
      ,
          "喻"
      ,
          "喘"
      ,
          "嘔"
      ,
          "鳴"
      ,
          "嗎"
      ,
          "嚇"
      ,
          "嚴"
      ,
          "嗜"
      ,
          "喊"
      ,
          "喝"
      ,
          "喧"
      ,
          "啜"
      ,
          "唆"
      ,
          "哨"
      ,
          "咆"
      ,
          "咬"
      ,
          "哇"
      ,
          "咪"
      ,
          "咒"
      ,
          "呻"
      ,
          "命"
      
    ]
   
 ,
    "人":[
       
          "仁"
      ,
          "今"
      ,
          "介"
      ,
          "付"
      ,
          "代"
      ,
          "以"
      ,
          "仙"
      ,
          "他"
      ,
          "仔"
      ,
          "仿"
      ,
          "你"
      ,
          "伙"
      ,
          "任"
      ,
          "休"
      ,
          "仲"
      ,
          "企"
      ,
          "份"
      ,
          "住"
      ,
          "位"
      ,
          "伸"
      ,
          "佈"
      ,
          "佔"
      ,
          "何"
      ,
          "作"
      ,
          "但"
      ,
          "佣"
      ,
          "伯"
      ,
          "例"
      ,
          "便"
      ,
          "供"
      ,
          "侮"
      ,
          "倉"
      ,
          "倍"
      ,
          "值"
      ,
          "假"
      ,
          "傾"
      ,
          "傳"
      ,
          "偉"
      ,
          "備"
      ,
          "倩"
      ,
          "像"
      ,
          "儀"
      ,
          "傷"
      ,
          "儲"
      ,
          "偶"
      ,
          "優"
      
    ]
,
    "木":[
       
          "本"
      ,
          "杆"
      ,
          "村"
      ,
          "材"
      ,
          "杏"
      ,
          "杭"
      ,
          "枉"
      ,
          "枝"
      ,
          "杯"
      ,
          "枇"
      ,
          "板"
      ,
          "柱"
      ,
          "染"
      ,
          "某"
      ,
          "枯"
      ,
          "查"
      ,
          "柚"
      ,
          "柏"
      ,
          "校"
      ,
          "核"
      ,
          "架"
      ,
          "根"
      ,
          "桌"
      ,
          "桐"
      ,
          "柴"
      ,
          "梯"
      ,
          "梳"
      ,
          "機"
      ,
          "椒"
      ,
          "棉"
      ,
          "極"
      ,
          "棠"
      ,
          "椅"
      ,
          "棧"
      ,
          "榮"
      ,
          "構"
      ,
          "概"
      ,
          "楊"
      ,
          "榜"
      ,
          "模"
      ,
          "樣"
      ,
          "標"
      ,
          "樂"
      ,
          "橋"
      ,
          "橙"
      ,
          "橫"
      
    ]
 ,
    "忄":[
       
          "必"
      ,
          "忘"
      ,
          "志"
      ,
          "忠"
      ,
          "念"
      ,
          "快"
      ,
          "忽"
      ,
          "怡"
      ,
          "思"
      ,
          "怯"
      ,
          "怎"
      ,
          "急"
      ,
          "性"
      ,
          "怪"
      ,
          "恥"
      ,
          "恐"
      ,
          "恩"
      ,
          "息"
      ,
          "恒"
      ,
          "悅"
      ,
          "悄"
      ,
          "惡"
      ,
          "惆"
      ,
          "悼"
      ,
          "意"
      ,
          "悶"
      ,
          "悸"
      ,
          "惹"
      ,
          "感"
      ,
          "想"
      ,
          "慢"
      ,
          "憐"
      ,
          "憎"
      ,
          "慚"
      ,
          "慮"
      ,
          "慣"
      ,
          "應"
      ,
          "憔"
      ,
          "懇"
      ,
          "懶"
      ,
          "戀"
      
    ]
 ,
    "心":[
       
          "必"
      ,
          "忘"
      ,
          "志"
      ,
          "忠"
      ,
          "念"
      ,
          "快"
      ,
          "忽"
      ,
          "怡"
      ,
          "思"
      ,
          "怯"
      ,
          "怎"
      ,
          "急"
      ,
          "性"
      ,
          "怪"
      ,
          "恥"
      ,
          "恐"
      ,
          "恩"
      ,
          "息"
      ,
          "恒"
      ,
          "悅"
      ,
          "悄"
      ,
          "惡"
      ,
          "惆"
      ,
          "悼"
      ,
          "意"
      ,
          "悶"
      ,
          "悸"
      ,
          "惹"
      ,
          "感"
      ,
          "想"
      ,
          "慢"
      ,
          "憐"
      ,
          "憎"
      ,
          "慚"
      ,
          "慮"
      ,
          "慣"
      ,
          "應"
      ,
          "憔"
      ,
          "懇"
      ,
          "懶"
      ,
          "戀"
      
    ]
 ,
    "讠":[
       
          "訂"
      ,
          "計"
      ,
          "訊"
      ,
          "記"
      ,
          "訓"
      ,
          "討"
      ,
          "許"
      ,
          "訛"
      ,
          "設"
      ,
          "註"
      ,
          "評"
      ,
          "詠"
      ,
          "詐"
      ,
          "詞"
      ,
          "詛"
      ,
          "診"
      ,
          "該"
      ,
          "詳"
      ,
          "誌"
      ,
          "話"
      ,
          "詢"
      ,
          "詭"
      ,
          "誓"
      ,
          "認"
      ,
          "識"
      ,
          "誼"
      ,
          "諒"
      ,
          "請"
      ,
          "誰"
      ,
          "調"
      ,
          "謝"
      ,
          "講"
      ,
          "警"
      ,
          "譚"
      ,
          "護"
      ,
          "譽"
      ,
          "讓"
      ,
          "讚"
      ,
          "讀"
      ,
          "證"
      
    ]
 ,
    "言":[
       
          "訂"
      ,
          "計"
      ,
          "訊"
      ,
          "記"
      ,
          "訓"
      ,
          "討"
      ,
          "許"
      ,
          "訛"
      ,
          "設"
      ,
          "註"
      ,
          "評"
      ,
          "詠"
      ,
          "詐"
      ,
          "詞"
      ,
          "詛"
      ,
          "診"
      ,
          "該"
      ,
          "詳"
      ,
          "誌"
      ,
          "話"
      ,
          "詢"
      ,
          "詭"
      ,
          "誓"
      ,
          "認"
      ,
          "識"
      ,
          "誼"
      ,
          "諒"
      ,
          "請"
      ,
          "誰"
      ,
          "調"
      ,
          "謝"
      ,
          "講"
      ,
          "警"
      ,
          "譚"
      ,
          "護"
      ,
          "譽"
      ,
          "讓"
      ,
          "讚"
      ,
          "讀"
      ,
          "證"
      
    ]
 ,
    "糸":[
       
          "約"
      ,
          "紅"
      ,
          "糾"
      ,
          "紗"
      ,
          "納"
      ,
          "紋"
      ,
          "素"
      ,
          "紡"
      ,
          "級"
      ,
          "紙"
      ,
          "紮"
      ,
          "紛"
      ,
          "終"
      ,
          "組"
      ,
          "細"
      ,
          "結"
      ,
          "統"
      ,
          "給"
      ,
          "絕"
      ,
          "絲"
      ,
          "經"
      ,
          "綁"
      ,
          "緒"
      ,
          "緊"
      ,
          "絹"
      ,
          "綜"
      ,
          "綿"
      ,
          "綠"
      ,
          "綵"
      ,
          "綽"
      ,
          "縫"
      ,
          "績"
      ,
          "繃"
      ,
          "辮"
      ,
          "繩"
      ,
          "繞"
      ,
          "繪"
      ,
          "續"
      ,
          "縮"
      ,
          "編"
      
    ]
 ,
    "女":[
       
          "奶"
      ,
          "妄"
      ,
          "如"
      ,
          "奴"
      ,
          "妖"
      ,
          "她"
      ,
          "妃"
      ,
          "姐"
      ,
          "始"
      ,
          "姓"
      ,
          "姑"
      ,
          "娃"
      ,
          "威"
      ,
          "委"
      ,
          "婆"
      ,
          "姻"
      ,
          "姚"
      ,
          "嫉"
      ,
          "嫌"
      ,
          "娶"
      ,
          "娛"
      ,
          "嫁"
      ,
          "嬌"
      ,
          "媳"
      ,
          "媽"
      ,
          "婦"
      ,
          "婚"
      ,
          "娼"
      ,
          "婉"
      ,
          "婪"
      ,
          "姦"
      ,
          "媒"
      ,
          "姿"
      ,
          "妹"
      ,
          "妍"
      ,
          "好"
      ,
          "妾"
      
    ]
 ,
    "土":[
       
          "地"
      ,
          "在"
      ,
          "圳"
      ,
          "型"
      ,
          "坐"
      ,
          "址"
      ,
          "均"
      ,
          "坎"
      ,
          "垃"
      ,
          "坦"
      ,
          "堵"
      ,
          "基"
      ,
          "城"
      ,
          "垢"
      ,
          "埋"
      ,
          "埃"
      ,
          "培"
      ,
          "場"
      ,
          "堤"
      ,
          "堆"
      ,
          "堅"
      ,
          "堂"
      ,
          "塵"
      ,
          "塊"
      ,
          "塘"
      ,
          "堡"
      ,
          "塔"
      ,
          "填"
      ,
          "增"
      ,
          "墟"
      ,
          "壇"
      ,
          "壁"
      ,
          "墳"
      ,
          "塌"
      ,
          "墓"
      ,
          "埠"
      ,
          "埔"
      
    ]
 ,
    "日":[
       
          "旦"
      ,
          "早"
      ,
          "旬"
      ,
          "昌"
      ,
          "昆"
      ,
          "昇"
      ,
          "昏"
      ,
          "旨"
      ,
          "易"
      ,
          "明"
      ,
          "是"
      ,
          "星"
      ,
          "春"
      ,
          "時"
      ,
          "晚"
      ,
          "景"
      ,
          "昨"
      ,
          "晏"
      ,
          "暈"
      ,
          "暑"
      ,
          "晴"
      ,
          "晶"
      ,
          "智"
      ,
          "暖"
      ,
          "暗"
      ,
          "曉"
      ,
          "暴"
      ,
          "曆"
      ,
          "曖"
      ,
          "曠"
      ,
          "曬"
      ,
          "暱"
      ,
          "暮"
      ,
          "暫"
      ,
          "曙"
      ,
          "映"
      ,
          "昧"
      ,
          "昔"
      ,
          "旺"
      
    ]
 ,
    "宀":[
       
          "安"
      ,
          "它"
      ,
          "守"
      ,
          "完"
      ,
          "宗"
      ,
          "牢"
      ,
          "定"
      ,
          "宜"
      ,
          "家"
      ,
          "宣"
      ,
          "客"
      ,
          "宦"
      ,
          "室"
      ,
          "宴"
      ,
          "官"
      ,
          "宮"
      ,
          "害"
      ,
          "宵"
      ,
          "寞"
      ,
          "寧"
      ,
          "富"
      ,
          "寄"
      ,
          "密"
      ,
          "寡"
      ,
          "寫"
      ,
          "寶"
      ,
          "實"
      ,
          "察"
      ,
          "寒"
      ,
          "寬"
      ,
          "寵"
      ,
          "寂"
      ,
          "宙"
      ,
          "宛"
      ,
          "宏"
      ,
          "宋"
      
    ]
 ,
    "灬":[
       
          "灰"
      ,
          "炎"
      ,
          "炒"
      ,
          "炆"
      ,
          "炊"
      ,
          "炫"
      ,
          "災"
      ,
          "灶"
      ,
          "烙"
      ,
          "烈"
      ,
          "煲"
      ,
          "炸"
      ,
          "炮"
      ,
          "炬"
      ,
          "焦"
      ,
          "焚"
      ,
          "烽"
      ,
          "焙"
      ,
          "煮"
      ,
          "煙"
      ,
          "煌"
      ,
          "煥"
      ,
          "煩"
      ,
          "煞"
      ,
          "然"
      ,
          "煤"
      ,
          "熄"
      ,
          "熔"
      ,
          "燭"
      ,
          "爆"
      ,
          "燒"
      ,
          "燙"
      ,
          "燥"
      ,
          "燦"
      ,
          "燴"
      ,
          "燈"
      ,
          "爐"
      
    ]
   
 ,
    "火":[
       
          "灰"
      ,
          "炎"
      ,
          "炒"
      ,
          "炆"
      ,
          "炊"
      ,
          "炫"
      ,
          "災"
      ,
          "灶"
      ,
          "烙"
      ,
          "烈"
      ,
          "煲"
      ,
          "炸"
      ,
          "炮"
      ,
          "炬"
      ,
          "焦"
      ,
          "焚"
      ,
          "烽"
      ,
          "焙"
      ,
          "煮"
      ,
          "煙"
      ,
          "煌"
      ,
          "煥"
      ,
          "煩"
      ,
          "煞"
      ,
          "然"
      ,
          "煤"
      ,
          "熄"
      ,
          "熔"
      ,
          "燭"
      ,
          "爆"
      ,
          "燒"
      ,
          "燙"
      ,
          "燥"
      ,
          "燦"
      ,
          "燴"
      ,
          "燈"
      ,
          "爐"
      
    ]
   
 ,
    "钅":[
       
          "針"
      ,
          "釘"
      ,
          "銅"
      ,
          "鈔"
      ,
          "銀"
      ,
          "鋤"
      ,
          "錯"
      ,
          "銳"
      ,
          "鋒"
      ,
          "錢"
      ,
          "鋼"
      ,
          "鏡"
      ,
          "錦"
      ,
          "鍾"
      ,
          "錘"
      ,
          "鋻"
      ,
          "鐳"
      ,
          "鑽"
      ,
          "鎖"
      ,
          "鋪"
      ,
          "鍛"
      ,
          "錄"
      ,
          "銘"
      ,
          "銜"
      ,
          "鉛"
      
    ]
 ,
    "金":[
       
          "針"
      ,
          "釘"
      ,
          "銅"
      ,
          "鈔"
      ,
          "銀"
      ,
          "鋤"
      ,
          "錯"
      ,
          "銳"
      ,
          "鋒"
      ,
          "錢"
      ,
          "鋼"
      ,
          "鏡"
      ,
          "錦"
      ,
          "鍾"
      ,
          "錘"
      ,
          "鋻"
      ,
          "鐳"
      ,
          "鑽"
      ,
          "鎖"
      ,
          "鋪"
      ,
          "鍛"
      ,
          "錄"
      ,
          "銘"
      ,
          "銜"
      ,
          "鉛"
      
    ]
 ,
    "虫":[
       
          "虹"
      ,
          "蚊"
      ,
          "蛇"
      ,
          "蛙"
      ,
          "蛛"
      ,
          "蛀"
      ,
          "蛋"
      ,
          "蛤"
      ,
          "蝶"
      ,
          "蛾"
      ,
          "蜇"
      ,
          "蝕"
      ,
          "蜂"
      ,
          "蜜"
      ,
          "蝴"
      ,
          "蝗"
      ,
          "蝦"
      ,
          "蟲"
      ,
          "融"
      ,
          "螞"
      ,
          "蟻"
      ,
          "蠍"
      ,
          "蟹"
      ,
          "蛹"
      ,
          "蠕"
      ,
          "蠱"
      ,
          "蠶"
      ,
          "蠻"
      
    ]
 ,
    "刀":[
       
          "分"
      ,
          "切"
      ,
          "判"
      ,
          "划"
      ,
          "刑"
      ,
          "刻"
      ,
          "前"
      ,
          "到"
      ,
          "削"
      ,
          "副"
      ,
          "則"
      ,
          "劇"
      ,
          "劈"
      ,
          "劍"
      ,
          "劃"
      ,
          "劊"
      ,
          "創"
      ,
          "利"
      ,
          "剛"
      ,
          "剝"
      ,
          "割"
      ,
          "制"
      ,
          "刮"
      ,
          "列"
      ,
          "刨"
      ,
          "券"
      ,
          "刃"
      ,
          "刁"
      
    ]
 ,
    "貝":[
       
          "貞"
      ,
          "財"
      ,
          "負"
      ,
          "貢"
      ,
          "責"
      ,
          "貧"
      ,
          "資"
      ,
          "貨"
      ,
          "貪"
      ,
          "販"
      ,
          "買"
      ,
          "貶"
      ,
          "貯"
      ,
          "貴"
      ,
          "賀"
      ,
          "賄"
      ,
          "賊"
      ,
          "賠"
      ,
          "賭"
      ,
          "賬"
      ,
          "賢"
      ,
          "賞"
      ,
          "賜"
      ,
          "賽"
      ,
          "賺"
      ,
          "購"
      ,
          "贈"
      ,
          "贊"
      ,
          "貼"
      ,
          "賤"
      
    ]
 ,
    "禾":[
       
          "秋"
      ,
          "禿"
      ,
          "秀"
      ,
          "私"
      ,
          "科"
      ,
          "秒"
      ,
          "秘"
      ,
          "稍"
      ,
          "移"
      ,
          "秩"
      ,
          "稅"
      ,
          "程"
      ,
          "稱"
      ,
          "稚"
      ,
          "稈"
      ,
          "稀"
      ,
          "租"
      ,
          "秧"
      ,
          "稠"
      ,
          "稜"
      ,
          "秦"
      ,
          "秤"
      ,
          "稟"
      
    ]
 ,
    "石":[
       
          "研"
      ,
          "砍"
      ,
          "砂"
      ,
          "碎"
      ,
          "砰"
      ,
          "破"
      ,
          "硬"
      ,
          "硝"
      ,
          "硯"
      ,
          "碗"
      ,
          "碰"
      ,
          "碑"
      ,
          "碧"
      ,
          "碟"
      ,
          "碩"
      ,
          "確"
      ,
          "碼"
      ,
          "磊"
      ,
          "磨"
      ,
          "磚"
      ,
          "礁"
      ,
          "礙"
      
    ]
 ,
    "罒 ":[
       
          "盯"
      ,
          "盲"
      ,
          "直"
      ,
          "看"
      ,
          "盾"
      ,
          "盼"
      ,
          "省"
      ,
          "真"
      ,
          "眨"
      ,
          "眺"
      ,
          "睫"
      ,
          "眠"
      ,
          "眾"
      ,
          "眶"
      ,
          "眉"
      ,
          "眼"
      ,
          "睛"
      ,
          "睹"
      ,
          "睦"
      ,
          "瞞"
      ,
          "瞄"
      ,
          "睡"
      ,
          "瞎"
      ,
          "瞳"
      ,
          "瞑"
      ,
          "睬"
      ,
          "睜"
      
    ]
 ,
    "目":[
       
          "盯"
      ,
          "盲"
      ,
          "直"
      ,
          "看"
      ,
          "盾"
      ,
          "盼"
      ,
          "省"
      ,
          "真"
      ,
          "眨"
      ,
          "眺"
      ,
          "睫"
      ,
          "眠"
      ,
          "眾"
      ,
          "眶"
      ,
          "眉"
      ,
          "眼"
      ,
          "睛"
      ,
          "睹"
      ,
          "睦"
      ,
          "瞞"
      ,
          "瞄"
      ,
          "睡"
      ,
          "瞎"
      ,
          "瞳"
      ,
          "瞑"
      ,
          "睬"
      ,
          "睜"
      
    ]
 ,
    "彳":[
       
          "彷"
      ,
          "役"
      ,
          "往"
      ,
          "待"
      ,
          "征"
      ,
          "很"
      ,
          "律"
      ,
          "後"
      ,
          "彼"
      ,
          "得"
      ,
          "徑"
      ,
          "從"
      ,
          "循"
      ,
          "復"
      ,
          "德"
      ,
          "微"
      ,
          "徹"
      ,
          "徵"
      ,
          "徘"
      ,
          "徊"
      ,
          "御"
      ,
          "徬"
      
    ]
 ,
    "⻊":[
       
          "跳"
      ,
          "趾"
      ,
          "跌"
      ,
          "跑"
      ,
          "趴"
      ,
          "跡"
      ,
          "路"
      ,
          "跟"
      ,
          "踩"
      ,
          "踐"
      ,
          "踢"
      ,
          "踏"
      ,
          "踝"
      ,
          "蹲"
      ,
          "跨"
      ,
          "跋"
      
    ]
 ,
    "足":[
       
          "跳"
      ,
          "趾"
      ,
          "跌"
      ,
          "跑"
      ,
          "趴"
      ,
          "跡"
      ,
          "路"
      ,
          "跟"
      ,
          "踩"
      ,
          "踐"
      ,
          "踢"
      ,
          "踏"
      ,
          "踝"
      ,
          "蹲"
      ,
          "跨"
      ,
          "跋"
      
    ]
 ,
    "力":[
       
          "功"
      ,
          "劫"
      ,
          "勤"
      ,
          "募"
      ,
          "動"
      ,
          "勳"
      ,
          "勸"
      ,
          "勵"
      ,
          "務"
      ,
          "勞"
      ,
          "勘"
      ,
          "勇"
      ,
          "勉"
      ,
          "勁"
      ,
          "努"
      ,
          "助"
      ,
          "勃"
       
    ]
 ,
    "田":[
       [
          "甲"
      ,
          "由"
      ,
          "申"
      ,
          "甸"
      ,
          "男"
      ,
          "畏"
      ,
          "界"
      ,
          "畜"
      ,
          "留"
      ,
          "畢"
      ,
          "異"
      ,
          "番"
      ,
          "畸"
      ,
          "當"
      ,
          "疊"
      ,
          "疇"
      ,
          "疆"
      ,
          "略"
      ,
          "畫"
      ,
          "畔"
      ,
          "畝"
       ]
    ]
 ,
    "車":[
       
          "軍"
      ,
          "軒"
      ,
          "軟"
      ,
          "軸"
      ,
          "較"
      ,
          "轉"
      ,
          "輕"
      ,
          "載"
      ,
          "輪"
      ,
          "輩"
      ,
          "輻"
      ,
          "輸"
      ,
          "輯"
      ,
          "輾"
      ,
          "轍"
      ,
          "轎"
      ,
          "轟"
      ,
          "輟"
      ,
          "轄"
      ,
          "輿"
      ,
          "輓"
      ,
          "軌"
       
    ]
 ,
    "馬":[
       
          "馮"
      ,
          "馭"
      ,
          "馴"
      ,
          "馳"
      ,
          "駁"
      ,
          "駝"
      ,
          "駐"
      ,
          "駛"
      ,
          "駕"
      ,
          "駱"
      ,
          "駭"
      ,
          "騎"
      ,
          "騙"
      ,
          "騷"
      ,
          "驚"
      ,
          "驗"
      ,
          "驢"
      ,
          "驀"
      ,
          "騾"
      ,
          "驅"
      ,
          "騰"
      ,
          "騁"
       
    ]
 ,
    "飠":[
       [
          "飢"
      ,
          "飯"
      ,
          "飲"
      ,
          "飼"
      ,
          "飽"
      ,
          "飪"
      ,
          "飾"
      ,
          "餅"
      ,
          "餌"
      ,
          "餐"
      ,
          "餓"
      ,
          "餘"
      ,
          "館"
      ,
          "饑"
      ,
          "餒"
      ,
          "餃"
      ,
          "養"
      ,
          "饅"
      ,
          "餿"
       ]
    ]
 ,
    "食":[
       [
          "飢"
      ,
          "飯"
      ,
          "飲"
      ,
          "飼"
      ,
          "飽"
      ,
          "飪"
      ,
          "飾"
      ,
          "餅"
      ,
          "餌"
      ,
          "餐"
      ,
          "餓"
      ,
          "餘"
      ,
          "館"
      ,
          "饑"
      ,
          "餒"
      ,
          "餃"
      ,
          "養"
      ,
          "饅"
      ,
          "餿"
       ]
    ]
 ,
    "門":[
       
          "閃"
      ,
          "閉"
      ,
          "問"
      ,
          "間"
      ,
          "開"
      ,
          "閱"
      ,
          "闖"
      ,
          "閘"
      ,
          "閥"
      ,
          "閣"
      ,
          "闊"
      ,
          "關"
      ,
          "閒"
      ,
          "閨"
      ,
          "閻"
      ,
          "闆"
      ,
          "闔"
      ,
          "悶"
       
    ]
 ,
    "耳":[
       
          "耶"
      ,
          "耿"
      ,
          "聆"
      ,
          "聖"
      ,
          "聊"
      ,
          "聚"
      ,
          "聲"
      ,
          "聰"
      ,
          "聽"
      ,
          "聯"
      ,
          "職"
      ,
          "聶"
      ,
          "聾"
      ,
          "聳"
      ,
          "耽"
      ,
          "聘"
       
    ]
 ,
    "山":[
       
          "岔"
      ,
          "岸"
      ,
          "峙"
      ,
          "峨"
      ,
          "島"
      ,
          "峰"
      ,
          "崇"
      ,
          "崖"
      ,
          "崎"
      ,
          "崗"
      ,
          "崛"
      ,
          "嶄"
      ,
          "嶽"
      ,
          "嶺"
      ,
          "巒"
      ,
          "巔"
      ,
          "崩"
      ,
          "嵌"
      ,
          "峭"
      ,
          "屹"
       
    ]
 ,
    "子":[
       
          "孔"
      ,
          "孝"
      ,
          "孟"
      ,
          "季"
      ,
          "孩"
      ,
          "孫"
      ,
          "學"
      ,
          "孿"
      ,
          "孽"
      ,
          "孺"
      ,
          "孵"
      ,
          "孤"
      ,
          "字"
      ,
          "存"
      ,
          "孕"
      ,
          "孜"
      ,
          "孰"
      ,
          "孱"
       
    ]
 ,
    "雨":[
       
          "雪"
      ,
          "雲"
      ,
          "零"
      ,
          "雷"
      ,
          "電"
      ,
          "雹"
      ,
          "需"
      ,
          "震"
      ,
          "霄"
      ,
          "霆"
      ,
          "霍"
      ,
          "霉"
      ,
          "霏"
      ,
          "霑"
      ,
          "霖"
      ,
          "霜"
      ,
          "霞"
      ,
          "霧"
      ,
          "霰"
      ,
          "露"
      ,
          "霹"
      ,
          "靈"
       
    ]
 ,
    "皿":[
       
          "盂"
      ,
          "盅"
      ,
          "盆"
      ,
          "盒"
      ,
          "盔"
      ,
          "盛"
      ,
          "盜"
      ,
          "盟"
      ,
          "盞"
      ,
          "盡"
      ,
          "監"
      ,
          "盤"
      ,
          "盪"
       
    ]
 ,
    "隹":[
       
          "隻"
      ,
          "雀"
      ,
          "雄"
      ,
          "雁"
      ,
          "雅"
      ,
          "集"
      ,
          "雇"
      ,
          "雍"
      ,
          "雋"
      ,
          "雕"
      ,
          "雖"
      ,
          "雙"
      ,
          "雛"
      ,
          "雜"
      ,
          "雞"
      ,
          "離"
      ,
          "難"
      ,
          "雌"
       
    ]
 ,
    "寸":[
       
          "寺"
      ,
          "封"
      ,
          "射"
      ,
          "專"
      ,
          "將"
      ,
          "尉"
      ,
          "尊"
      ,
          "尋"
      ,
          "對"
      ,
          "導"
       
    ]
 ,
    "欠":[
       
          "次"
      ,
          "欣"
      ,
          "欲"
      ,
          "欽"
      ,
          "欺"
      ,
          "款"
      ,
          "歇"
      ,
          "歉"
      ,
          "歎"
      ,
          "歐"
      ,
          "歡"
      ,
          "歌"
       
    ]
 ,
    "牜":[
       
          "牠"
      ,
          "牢"
      ,
          "牧"
      ,
          "物"
      ,
          "牲"
      ,
          "牯"
      ,
          "特"
      ,
          "牽"
      ,
          "犁"
      ,
          "犀"
      ,
          "犄"
      ,
          "犧"
       
    ]
 ,
    "牛":[
       
          "牠"
      ,
          "牢"
      ,
          "牧"
      ,
          "物"
      ,
          "牲"
      ,
          "牯"
      ,
          "特"
      ,
          "牽"
      ,
          "犁"
      ,
          "犀"
      ,
          "犄"
      ,
          "犧"
       
    ]
 ,
    "羽":[
       
          "羿"
      ,
          "翁"
      ,
          "翅"
      ,
          "翎"
      ,
          "翌"
      ,
          "習"
      ,
          "翠"
      ,
          "翡"
      ,
          "翩"
      ,
          "翼"
      ,
          "翹"
      ,
          "翻"
      ,
          "耀"
      ,
          "翰"
       
    ]
 ,
    "鳥":[
       
          "鳩"
      ,
          "鳳"
      ,
          "鳴"
      ,
          "鳶"
      ,
          "鴉"
      ,
          "鴕"
      ,
          "鴛"
      ,
          "鴣"
      ,
          "鴦"
      ,
          "鴨"
      ,
          "鴿"
      ,
          "鴻"
      ,
          "鵑"
      ,
          "鵝"
      ,
          "鵡"
      ,
          "鵬"
      ,
          "鵪"
      ,
          "鵲"
      ,
          "鶴"
      ,
          "鶯"
      ,
          "鷺"
      ,
          "鷹"
      ,
          "鸚"
       
    ]
 ,
    "戈":[
       
          "戊"
      ,
          "戌"
      ,
          "戍"
      ,
          "戎"
      ,
          "成"
      ,
          "戒"
      ,
          "我"
      ,
          "或"
      ,
          "戚"
      ,
          "截"
      ,
          "戮"
      ,
          "戰"
      ,
          "戲"
      ,
          "戴"
       
    ]
 ,
    "又":[
       
          "叉"
      ,
          "及"
      ,
          "友"
      ,
          "反"
      ,
          "叔"
      ,
          "取"
      ,
          "受"
      ,
          "叛"
      ,
          "叟"
      ,
          "叢"
       
    ]
 ,
    "穴":[
       
          "究"
      ,
          "穹"
      ,
          "空"
      ,
          "穿"
      ,
          "突"
      ,
          "窄"
      ,
          "窒"
      ,
          "窕"
      ,
          "窗"
      ,
          "窘"
      ,
          "窟"
      ,
          "窩"
      ,
          "窪"
      ,
          "窮"
      ,
          "竄"
      ,
          "竅"
      ,
          "竊"
       
    ]
 ,
    "弓":[
       
          "引"
      ,
          "弘"
      ,
          "弛"
      ,
          "弟"
      ,
          "弦"
      ,
          "弧"
      ,
          "弭"
      ,
          "弱"
      ,
          "張"
      ,
          "強"
      ,
          "彈"
      ,
          "彊"
      ,
          "彌"
      ,
          "彎"
       
    ]
 ,
    "米":[
       
          "粉"
      ,
          "粒"
      ,
          "粕"
      ,
          "粗"
      ,
          "粟"
      ,
          "粢"
      ,
          "粵"
      ,
          "粥"
      ,
          "粹"
      ,
          "精"
      ,
          "糊"
      ,
          "粽"
      ,
          "糕"
      ,
          "糖"
      ,
          "糗"
      ,
          "糙"
      ,
          "糜"
      ,
          "糞"
      ,
          "糟"
      ,
          "糠"
      ,
          "糧"
      ,
          "糯"
       
    ]
 ,
    "八":[
       
          "公"
      ,
          "共"
      ,
          "兵"
      ,
          "其"
      ,
          "具"
      ,
          "典"
      ,
          "兼"
      ,
          "冀"
       
    ]
 ,
    "酉":[
       
          "酊"
      ,
          "酋"
      ,
          "酌"
      ,
          "配"
      ,
          "酒"
      ,
          "酗"
      ,
          "酢"
      ,
          "酣"
      ,
          "酥"
      ,
          "酩"
      ,
          "酪"
      ,
          "酬"
      ,
          "酵"
      ,
          "酷"
      ,
          "酸"
      ,
          "醃"
      ,
          "醇"
      ,
          "醉"
      ,
          "醋"
      ,
          "醍"
      ,
          "醐"
      ,
          "醒"
      ,
          "醜"
      ,
          "醞"
      ,
          "醫"
      ,
          "醬"
      ,
          "釀"
       
    ]
 ,
    "月":[
       
          "有"
      ,
          "朋"
      ,
          "服"
      ,
          "朔"
      ,
          "朗"
      ,
          "望"
      ,
          "期"
      ,
          "朝"
      ,
          "朦"
      ,
          "朧"
       
    ]
 ,
    "止":[
       
          "正"
      ,
          "此"
      ,
          "步"
      ,
          "歧"
      ,
          "武"
      ,
          "歪"
      ,
          "歲"
      ,
          "歷"
      ,
          "歸"
       
    ]
 ,
    "方":[
       
          "於"
      ,
          "施"
      ,
          "旁"
      ,
          "旅"
      ,
          "旋"
      ,
          "族"
      ,
          "旗"
       
    ]
 ,
    "見":[
       
          "規"
      ,
          "覓"
      ,
          "視"
      ,
          "靦"
      ,
          "親"
      ,
          "覬"
      ,
          "覷"
      ,
          "覺"
      ,
          "覽"
      ,
          "觀"
       
    ]
 ,
    "二":[
       
          "于"
      ,
          "云"
      ,
          "互"
      ,
          "五"
      ,
          "井"
      ,
          "亙"
      ,
          "些"
      ,
          "亞"
       
    ]
 ,
    "夕":[
       
          "外"
      ,
          "多"
      ,
          "夙"
      ,
          "夜"
      ,
          "夠"
      ,
          "夢"
      ,
          "夥"
       
    ]
 ,
    "羊":[
       
          "羌"
      ,
          "美"
      ,
          "羔"
      ,
          "羚"
      ,
          "羞"
      ,
          "羲"
      ,
          "羹"
       
    ]
 ,
    "行":[
       
          "衍"
      ,
          "街"
      ,
          "衙"
      ,
          "衡"
      ,
          "衝"
      ,
          "衛"
       
    ]
 ,
    "斤":[
       
          "斥"
      ,
          "斧"
      ,
          "斬"
      ,
          "斯"
      ,
          "新"
      ,
          "斷"
       
    ]
 ,
    "广":[
       
          "庇"
      ,
          "床"
      ,
          "序"
      ,
          "底"
      ,
          "庖"
      ,
          "店"
      ,
          "庚"
      ,
          "府"
      ,
          "度"
      ,
          "座"
      ,
          "席"
      ,
          "庫"
      ,
          "庭"
      ,
          "庵"
      ,
          "庶"
      ,
          "康"
      ,
          "庸"
      ,
          "庾"
      ,
          "廁"
      ,
          "廂"
      ,
          "廈"
      ,
          "廉"
      ,
          "廊"
      ,
          "廖"
      ,
          "廚"
      ,
          "塵"
      ,
          "廟"
      ,
          "廠"
      ,
          "廢"
      ,
          "廣"
      ,
          "廳"
       
    ]
 ,
    "艸":[
       
          "芍"
      ,
          "芋"
      ,
          "芒"
      ,
          "芝"
      ,
          "芥"
      ,
          "芳"
      ,
          "芬"
      ,
          "花"
      ,
          "芽"
      ,
          "芷"
      ,
          "苗"
      ,
          "若"
      ,
          "英"
      ,
          "茁"
      ,
          "范"
      ,
          "茄"
      ,
          "菜"
      ,
          "茶"
      ,
          "荊"
      ,
          "草"
      ,
          "荷"
      ,
          "莎"
      ,
          "莖"
      ,
          "莽"
      ,
          "華"
      ,
          "菌"
      ,
          "菲"
      ,
          "著"
      ,
          "萄"
      ,
          "萌"
      ,
          "萬"
      ,
          "落"
      ,
          "葉"
      ,
          "董"
      ,
          "葵"
      ,
          "蒙"
      ,
          "蒜"
      ,
          "蒲"
      ,
          "蒸"
      ,
          "蒼"
      ,
          "蓉"
      ,
          "蓋"
      ,
          "蓮"
      ,
          "蓬"
      ,
          "蔑"
      ,
          "蔡"
      ,
          "蔬"
      ,
          "蕃"
      ,
          "蕉"
      ,
          "薄"
      ,
          "蕭"
      ,
          "舊"
      ,
          "藍"
      ,
          "藏"
      ,
          "藝"
      ,
          "蘇"
      ,
          "蘋"
       
    ]
 ,
    "大":[
       
          "天"
      ,
          "太"
      ,
          "夫"
      ,
          "夭"
      ,
          "失"
      ,
          "央"
      ,
          "夷"
      ,
          "夾"
      ,
          "奇"
      ,
          "奈"
      ,
          "奉"
      ,
          "奔"
      ,
          "奏"
      ,
          "契"
      ,
          "套"
      ,
          "奚"
      ,
          "奠"
      ,
          "奧"
      ,
          "奪"
      ,
          "獎"
      ,
          "奮"
       
    ]
 ,
    "疒":[
       
          "疙"
      ,
          "疚"
      ,
          "疫"
      ,
          "疤"
      ,
          "痠"
      ,
          "疲"
      ,
          "疹"
      ,
          "疼"
      ,
          "疾"
      ,
          "痂"
      ,
          "病"
      ,
          "症"
      ,
          "痔"
      ,
          "痛"
      ,
          "痕"
      ,
          "痘"
      ,
          "痙"
      ,
          "痰"
      ,
          "痲"
      ,
          "瘋"
      ,
          "瘧"
      ,
          "瘠"
      ,
          "瘦"
      ,
          "療"
      ,
          "癒"
      ,
          "癢"
      ,
          "癆"
      ,
          "癬"
      ,
          "癮子"
       
    ]
 ,
    "氵":[
       
          "潔"
      ,
          "洗"
      ,
          "江"
      ,
          "河"
      ,
          "潘"
      ,
          "潭"
      ,
          "澆"
      ,
          "濟"
      ,
          "泉"
      ,
          "濁"
      ,
          "流"
      ,
          "灑"
      ,
          "沐"
      ,
          "沒"
      ,
          "沖"
      ,
          "沸"
      ,
          "治"
      ,
          "油"
      ,
          "法"
      ,
          "津"
      ,
          "洪"
      ,
          "派"
      ,
          "浙"
      ,
          "浮"
      ,
          "浴"
      ,
          "海"
      ,
          "源"
      ,
          "消"
      ,
          "淪"
      ,
          "混"
      ,
          "清"
      ,
          "減"
      ,
          "活"
      ,
          "溫"
      ,
          "港"
      ,
          "渴"
      ,
          "游"
      ,
          "湯"
      ,
          "準"
      ,
          "溪"
      ,
          "滅"
      ,
          "滑"
      ,
          "滔"
      ,
          "滴"
      ,
          "漆"
      ,
          "漏"
      ,
          "漬"
      ,
          "澗"
       
    ]
 ,
    "氺":[
       
          "潔"
      ,
          "洗"
      ,
          "江"
      ,
          "河"
      ,
          "潘"
      ,
          "潭"
      ,
          "澆"
      ,
          "濟"
      ,
          "泉"
      ,
          "濁"
      ,
          "流"
      ,
          "灑"
      ,
          "沐"
      ,
          "沒"
      ,
          "沖"
      ,
          "沸"
      ,
          "治"
      ,
          "油"
      ,
          "法"
      ,
          "津"
      ,
          "洪"
      ,
          "派"
      ,
          "浙"
      ,
          "浮"
      ,
          "浴"
      ,
          "海"
      ,
          "源"
      ,
          "消"
      ,
          "淪"
      ,
          "混"
      ,
          "清"
      ,
          "減"
      ,
          "活"
      ,
          "溫"
      ,
          "港"
      ,
          "渴"
      ,
          "游"
      ,
          "湯"
      ,
          "準"
      ,
          "溪"
      ,
          "滅"
      ,
          "滑"
      ,
          "滔"
      ,
          "滴"
      ,
          "漆"
      ,
          "漏"
      ,
          "漬"
      ,
          "澗"
       
    ]
 ,
    "犭":[
       
          "犯"
      ,
          "狂"
      ,
          "狃"
      ,
          "狄"
      ,
          "狀"
      ,
          "狐"
      ,
          "狎"
      ,
          "狗"
      ,
          "狙"
      ,
          "狹"
      ,
          "狠"
      ,
          "狩"
      ,
          "狸"
      ,
          "狽"
      ,
          "狼"
      ,
          "猖"
      ,
          "猙"
      ,
          "猛"
      ,
          "猜"
      ,
          "猝"
      ,
          "猶"
      ,
          "猥"
      ,
          "猩"
      ,
          "猴"
      ,
          "猾"
      ,
          "獠"
      ,
          "獨"
      ,
          "獰"
      ,
          "獲"
      ,
          "獸"
      ,
          "獵"
      ,
          "獻"
      ,
          "獺"
       
    ]
 ,
    "水":[
       
          "潔"
      ,
          "洗"
      ,
          "江"
      ,
          "河"
      ,
          "潘"
      ,
          "潭"
      ,
          "澆"
      ,
          "濟"
      ,
          "泉"
      ,
          "濁"
      ,
          "流"
      ,
          "灑"
      ,
          "沐"
      ,
          "沒"
      ,
          "沖"
      ,
          "沸"
      ,
          "治"
      ,
          "油"
      ,
          "法"
      ,
          "津"
      ,
          "洪"
      ,
          "派"
      ,
          "浙"
      ,
          "浮"
      ,
          "浴"
      ,
          "海"
      ,
          "源"
      ,
          "消"
      ,
          "淪"
      ,
          "混"
      ,
          "清"
      ,
          "減"
      ,
          "活"
      ,
          "溫"
      ,
          "港"
      ,
          "渴"
      ,
          "游"
      ,
          "湯"
      ,
          "準"
      ,
          "溪"
      ,
          "滅"
      ,
          "滑"
      ,
          "滔"
      ,
          "滴"
      ,
          "漆"
      ,
          "漏"
      ,
          "漬"
      ,
          "澗"
       
    ]
 ,
    "犬":[
       
          "犯"
      ,
          "狂"
      ,
          "狃"
      ,
          "狄"
      ,
          "狀"
      ,
          "狐"
      ,
          "狎"
      ,
          "狗"
      ,
          "狙"
      ,
          "狹"
      ,
          "狠"
      ,
          "狩"
      ,
          "狸"
      ,
          "狽"
      ,
          "狼"
      ,
          "猖"
      ,
          "猙"
      ,
          "猛"
      ,
          "猜"
      ,
          "猝"
      ,
          "猶"
      ,
          "猥"
      ,
          "猩"
      ,
          "猴"
      ,
          "猾"
      ,
          "獠"
      ,
          "獨"
      ,
          "獰"
      ,
          "獲"
      ,
          "獸"
      ,
          "獵"
      ,
          "獻"
      ,
          "獺"
       
    ]
 ,
    "竹":[
       
          "竺"
      ,
          "竿"
      ,
          "笑"
      ,
          "笨"
      ,
          "笛"
      ,
          "笠"
      ,
          "符"
      ,
          "第"
      ,
          "等"
      ,
          "筍"
      ,
          "筆"
      ,
          "筒"
      ,
          "答"
      ,
          "策"
      ,
          "筷"
      ,
          "箇"
      ,
          "箕"
      ,
          "算"
      ,
          "管"
      ,
          "箭"
      ,
          "箱"
      ,
          "節"
      ,
          "範"
      ,
          "簡"
      ,
          "簾"
      ,
          "簿"
      ,
          "簫"
      ,
          "籌"
      ,
          "籍"
      ,
          "籤"
      ,
          "籠"
       
    ]
 ,
    "辶":[
       
          "迅"
      ,
          "迎"
      ,
          "近"
      ,
          "返"
      ,
          "迢"
      ,
          "迪"
      ,
          "迫"
      ,
          "迷"
      ,
          "述"
      ,
          "退"
      ,
          "送"
      ,
          "逃"
      ,
          "逆"
      ,
          "透"
      ,
          "逐"
      ,
          "途"
      ,
          "通"
      ,
          "逝"
      ,
          "造"
      ,
          "逢"
      ,
          "連"
      ,
          "週"
      ,
          "逸"
      ,
          "逼"
      ,
          "遇"
      ,
          "遊"
      ,
          "運"
      ,
          "過"
      ,
          "遍"
      ,
          "違"
      ,
          "達"
      ,
          "遠"
      ,
          "遞"
      ,
          "遭"
      ,
          "適"
      ,
          "遲"
      ,
          "遷"
      ,
          "選"
      ,
          "遺"
      ,
          "避"
      ,
          "邀"
      ,
          "邊"
      ,
          "邏"
       
    ]
 ,
    "辵":[
       
          "迅"
      ,
          "迎"
      ,
          "近"
      ,
          "返"
      ,
          "迢"
      ,
          "迪"
      ,
          "迫"
      ,
          "迷"
      ,
          "述"
      ,
          "退"
      ,
          "送"
      ,
          "逃"
      ,
          "逆"
      ,
          "透"
      ,
          "逐"
      ,
          "途"
      ,
          "通"
      ,
          "逝"
      ,
          "造"
      ,
          "逢"
      ,
          "連"
      ,
          "週"
      ,
          "逸"
      ,
          "逼"
      ,
          "遇"
      ,
          "遊"
      ,
          "運"
      ,
          "過"
      ,
          "遍"
      ,
          "違"
      ,
          "達"
      ,
          "遠"
      ,
          "遞"
      ,
          "遭"
      ,
          "適"
      ,
          "遲"
      ,
          "遷"
      ,
          "選"
      ,
          "遺"
      ,
          "避"
      ,
          "邀"
      ,
          "邊"
      ,
          "邏"
       
    ]
 ,
    "肉":[
       
          "肋"
      ,
          "肌"
      ,
          "肘"
      ,
          "肚"
      ,
          "肖"
      ,
          "肛"
      ,
          "肝"
      ,
          "股"
      ,
          "肢"
      ,
          "肥"
      ,
          "肩"
      ,
          "肪"
      ,
          "肯"
      ,
          "育"
      ,
          "肴"
      ,
          "胃"
      ,
          "背"
      ,
          "胖"
      ,
          "肺"
      ,
          "胚"
      ,
          "胞"
      ,
          "胡"
      ,
          "胱"
      ,
          "胸"
      ,
          "能"
      ,
          "脂"
      ,
          "脅"
      ,
          "脈"
      ,
          "脫"
      ,
          "脣"
      ,
          "脖"
      ,
          "脾"
      ,
          "腎"
      ,
          "腑"
      ,
          "腐"
      ,
          "腥"
      ,
          "腦"
      ,
          "腰"
      ,
          "腳"
      ,
          "腸"
      ,
          "腹"
      ,
          "腿"
      ,
          "膏"
      ,
          "膚"
      ,
          "膝"
      ,
          "膳"
      ,
          "膽"
      ,
          "臂"
      ,
          "臘"
       
    ]
 ,
    "阝":[
       
          "防"
      ,
          "阻"
      ,
          "阿"
      ,
          "陀"
      ,
          "附"
      ,
          "陋"
      ,
          "陌"
      ,
          "降"
      ,
          "陛"
      ,
          "陝"
      ,
          "陡"
      ,
          "院"
      ,
          "陣"
      ,
          "除"
      ,
          "陪"
      ,
          "陰"
      ,
          "陳"
      ,
          "陶"
      ,
          "陸"
      ,
          "陽"
      ,
          "隅"
      ,
          "隋"
      ,
          "階"
      ,
          "隔"
      ,
          "際"
      ,
          "障"
      ,
          "隨"
      ,
          "險"
      ,
          "隱"
      ,
          "隴"
       
    ]
 ,
    "⻏":[
       
          "防"
      ,
          "阻"
      ,
          "阿"
      ,
          "陀"
      ,
          "附"
      ,
          "陋"
      ,
          "陌"
      ,
          "降"
      ,
          "陛"
      ,
          "陝"
      ,
          "陡"
      ,
          "院"
      ,
          "陣"
      ,
          "除"
      ,
          "陪"
      ,
          "陰"
      ,
          "陳"
      ,
          "陶"
      ,
          "陸"
      ,
          "陽"
      ,
          "隅"
      ,
          "隋"
      ,
          "階"
      ,
          "隔"
      ,
          "際"
      ,
          "障"
      ,
          "隨"
      ,
          "險"
      ,
          "隱"
      ,
          "隴"
       
    ]
 ,
    "阜":[
       
          "防"
      ,
          "阻"
      ,
          "阿"
      ,
          "陀"
      ,
          "附"
      ,
          "陋"
      ,
          "陌"
      ,
          "降"
      ,
          "陛"
      ,
          "陝"
      ,
          "陡"
      ,
          "院"
      ,
          "陣"
      ,
          "除"
      ,
          "陪"
      ,
          "陰"
      ,
          "陳"
      ,
          "陶"
      ,
          "陸"
      ,
          "陽"
      ,
          "隅"
      ,
          "隋"
      ,
          "階"
      ,
          "隔"
      ,
          "際"
      ,
          "障"
      ,
          "隨"
      ,
          "險"
      ,
          "隱"
      ,
          "隴"
       
    ]
 ,
    "礻":[
       
          "社"
      ,
          "祀"
      ,
          "祉"
      ,
          "祇"
      ,
          "祈"
      ,
          "祕"
      ,
          "祐"
      ,
          "祖"
      ,
          "祝"
      ,
          "祛"
      ,
          "神"
      ,
          "祟"
      ,
          "祠"
      ,
          "祥"
      ,
          "票"
      ,
          "祭"
      ,
          "禁"
      ,
          "禍"
      ,
          "福"
      ,
          "祿"
      ,
          "禦"
      ,
          "禪"
      ,
          "禧"
      ,
          "禮"
       
    ]
 ,
    "示":[
       
          "社"
      ,
          "祀"
      ,
          "祉"
      ,
          "祇"
      ,
          "祈"
      ,
          "祕"
      ,
          "祐"
      ,
          "祖"
      ,
          "祝"
      ,
          "祛"
      ,
          "神"
      ,
          "祟"
      ,
          "祠"
      ,
          "祥"
      ,
          "票"
      ,
          "祭"
      ,
          "禁"
      ,
          "禍"
      ,
          "福"
      ,
          "祿"
      ,
          "禦"
      ,
          "禪"
      ,
          "禧"
      ,
          "禮"
       
    ]
 ,
    "豕":[
       
          "豚"
      ,
          "象"
      ,
          "豪"
      ,
          "豫"
      ,
          "豬"
       
    ]
 ,
    "尸":[
       
          "尺"
      ,
          "尹"
      ,
          "屁"
      ,
          "尼"
      ,
          "尾"
      ,
          "尿"
      ,
          "局"
      ,
          "居"
      ,
          "屆"
      ,
          "屈"
      ,
          "屋"
      ,
          "屍"
      ,
          "屎"
      ,
          "展"
      ,
          "屑"
      ,
          "屏"
      ,
          "屜"
      ,
          "屠"
      ,
          "屢"
      ,
          "層"
      ,
          "履"
      ,
          "屬"
       
    ]
 ,
    "攵":[
       
          "收"
      ,
          "改"
      ,
          "攻"
      ,
          "放"
      ,
          "政"
      ,
          "故"
      ,
          "效"
      ,
          "敘"
      ,
          "教"
      ,
          "救"
      ,
          "敖"
      ,
          "敗"
      ,
          "散"
      ,
          "敢"
      ,
          "敦"
      ,
          "敬"
      ,
          "敲"
      ,
          "敵"
      ,
          "敷"
      ,
          "數"
      ,
          "整"
      ,
          "斂"
      ,
          "斃"
       
    ]
 ,
    "攴":[
       
          "收"
      ,
          "改"
      ,
          "攻"
      ,
          "放"
      ,
          "政"
      ,
          "故"
      ,
          "效"
      ,
          "敘"
      ,
          "教"
      ,
          "救"
      ,
          "敖"
      ,
          "敗"
      ,
          "散"
      ,
          "敢"
      ,
          "敦"
      ,
          "敬"
      ,
          "敲"
      ,
          "敵"
      ,
          "敷"
      ,
          "數"
      ,
          "整"
      ,
          "斂"
      ,
          "斃"
       
    ]
 ,
    "歺":[
       
          "死"
      ,
          "歿"
      ,
          "殄"
      ,
          "殆"
      ,
          "殉"
      ,
          "殖"
      ,
          "殘"
      ,
          "殞"
      ,
          "殮"
      ,
          "殯"
       
    ]
 ,
    "歹":[
       
          "死"
      ,
          "歿"
      ,
          "殄"
      ,
          "殆"
      ,
          "殉"
      ,
          "殖"
      ,
          "殘"
      ,
          "殞"
      ,
          "殮"
      ,
          "殯"
       
    ]
 ,
    "气":[
       
          "氛"
      ,
          "氣"
      ,
          "氧"
      ,
          "氫"
      ,
          "氮"
      ,
          "氬"
      ,
          "氯"
       
    ]
 ,
    "衤":[
       
          "表"
      ,
          "衰"
      ,
          "衲"
      ,
          "衷"
      ,
          "袖"
      ,
          "袈"
      ,
          "袋"
      ,
          "袍"
      ,
          "被"
      ,
          "袱"
      ,
          "裁"
      ,
          "裂"
      ,
          "裙"
      ,
          "裏"
      ,
          "裔"
      ,
          "裕"
      ,
          "補"
      ,
          "裝"
      ,
          "裸"
      ,
          "裳"
      ,
          "製"
      ,
          "褂"
      ,
          "複"
      ,
          "褲"
      ,
          "衫"
      ,
          "袁"
      ,
          "襟"
      ,
          "襖"
      ,
          "襪"
      ,
          "襯"
       
    ]
 ,
    "衣":[
       
          "表"
      ,
          "衰"
      ,
          "衲"
      ,
          "衷"
      ,
          "袖"
      ,
          "袈"
      ,
          "袋"
      ,
          "袍"
      ,
          "被"
      ,
          "袱"
      ,
          "裁"
      ,
          "裂"
      ,
          "裙"
      ,
          "裏"
      ,
          "裔"
      ,
          "裕"
      ,
          "補"
      ,
          "裝"
      ,
          "裸"
      ,
          "裳"
      ,
          "製"
      ,
          "褂"
      ,
          "複"
      ,
          "褲"
      ,
          "衫"
      ,
          "袁"
      ,
          "襟"
      ,
          "襖"
      ,
          "襪"
      ,
          "襯"
       
    ]
 ,
    "頁":[
       
          "頂"
      ,
          "頃"
      ,
          "項"
      ,
          "順"
      ,
          "須"
      ,
          "頌"
      ,
          "預"
      ,
          "頑"
      ,
          "頒"
      ,
          "頓"
      ,
          "領"
      ,
          "頗"
      ,
          "頤"
      ,
          "頭"
      ,
          "頰"
      ,
          "頸"
      ,
          "頹"
      ,
          "頻"
      ,
          "顆"
      ,
          "額"
      ,
          "題"
      ,
          "顎"
      ,
          "顏"
      ,
          "願"
      ,
          "顛"
      ,
          "類"
      ,
          "顧"
      ,
          "顫"
      ,
          "顯"
      ,
          "顱"
       
    ],
    "一":[
          "一"
      ,
          "丁"  
      ,
          "七"
      ,
          "上"
      ,
          "三"
      ,
          "丈"
      ,
          "不"
      ,
          "丐"
      ,
          "東"
      ,
          "丕"
      ,
          "且"
      ,
          "丞"
      ,
          "下"
      ],
     "丨":[
          "中"
      ,
          "丫"
      ,  
          "串"
      ],
       "丶":[
          "丸"
      ,
          "凡"  
      ,
          "丹"
      ,
          "主"
      ],
       "丿":[
          "乃"
      ,
          "久"  
      ,
          "之"
      ,
          "乏"
      ,
          "乎"
      ,
          "乒"
      ,
          "乖"
      ],
      
  "乙":[
          "乙"
      ,
          "九"  
      ,
          "也"
      ,
          "乞"
      ,
          "乳"
      ,
          "乾"
      ,
          "亂"
      ],
    "亅":[
          "了"
      ,
          "予"  
      ,
          "事"
      ],
    "亠":[
          "亡"
      ,
          "交"  
      ,
          "亦"
      ,
          "亥"
      ,
          "亨"
      ,
          "享"
      ,
          "亭"
      ,
          "亮"
      ,
          "京"
      ],
      "儿":[
          "元"
      ,
          "允"  
      ,
          "兄"
      ,
          "充"
      ,
          "光"
      ,
          "兇"
      ,
          "兆"
      ,
          "先"
      ,
          "兑"
      ,
          "免"
      ,
          "兔"
      ,
          "兒"
      ,
          "克"
      ],
      "入":[
          "入"
      ,
          "內"  
      ,
          "全"
      ,
          "兩"
      ],
       "冖":[
          "冠"
      ,
          "冥"  
      ,
          "冤"
      ],
      "冂":[
          "冉"
      ,
          "冊"  
      ,
          "再"
      , 
          "最"
      ,   
          "冕"
      ,
          "冒"
      ],
       "冫":[
          "冬"
      ,
          "冰"  
      ,
          "冶"
      ,
          "冷"
      ,
          "凍"
      ,
          "凌"
      ,
          "准"
      ,
          "凋"
      ,
          "凝"
      ],
       "几":[
          "鳳"
      ,
          "凱"  
      ,
          "凳"
      ],
      "凵":[
          "凶"
      ,
          "凹"  
      ,
          "凸"  
      ,     
          "函"  
      ,
          "出"
      ],
      "勹":[
          "勻"
      ,
          "勾"  
      ,
          "勿"
      ,
          "冷"
      ,
          "凍"
      ,
          "凌"
      ,
          "准"
      ,
          "凋"
      ,
          "凝"
      ],
       "匕":[
          "化"
      ,
          "北"  
      ,
          "匙"
      ],
      "匸":[
          "匹"
      ,
          "匾"  
      ,
          "匿"
      ,
          "區"
      ],
       "匚":[
          "匝"
      ,
          "匡"  
      ,
          "匠"
      ,
          "匣"
      ,
          "匪"
      ,
          "匯"
      ],
        "十":[
          "十"
      ,
          "千"  
      ,
          "午"
      ,
          "升"
      ,
          "半"
      ,
          "卒"
      ,
          "協"
      ,
          "卑"
      ,
          "南"
      ,
          "博"
      ,
          "卓"
      ,
          "卉"
      ],
       "卜":[
          "卜"
      ,
          "卡"  
      ,
          "占"
      ,
          "卦"
      ],  
        "卩":[
          "卯"
      ,
          "印"  
      ,
          "午"
      ,
          "危"
      ,
          "即"
      ,
          "卵"
      ,
          "卷"
      ,
          "卸"
      ,
          "卻"
      ,
          "卿"
      ],
        "厂":[
          "厄"
      ,
          "厚"  
      ,
          "厘"
      ,
          "原"
      ,
          "厥"
      ,
          "厭"
      ,
          "厲"
      ],
       "厶":[
          "去"
      ,
          "參"  
      ],  
        "囗":[
          "四"
      ,
          "囚"  
      ,
          "因"
      ,
          "回"
      ,
          "困"
      ,
          "囱"
      ,
          "固"
      ,
          "圃"
      ,
          "圈"
      ,
          "圍"
      ,
          "園"
      ,
          "圓"
      ,
          "團"
      ,
          "國"
      ],
       "士":[
          "士"
      ,
          "壯"  
      ,
          "壹"
      ,
          "壺"
      ,
          "壽"
      ],
       "夂":[
          "夏"
      ],
       "小":[
          "小"
      ,
          "少"  
      ,
          "尖"
      ,
          "尚"
      ],
       "尢":[
          "尤"
      ,
          "尬"  
      ,
          "就"
      ,
          "尷"
      ],
        "屮":[
          "屯"
      ],
       "巛":[
          "川"
      ,
          "州"  
      ,
          "巢"
      ],
       "工":[
          "工"
      ,
          "巨"  
      ,
          "巧"
      ,
          "巫"
      ,
          "差"
      ,
          "左"
      ],
       "己":[
          "己"
      ,
          "已"  
      ,
          "巴"
      ,
          "巷"
      ,
          "巽"
      ],
      "巾":[
          "巾"
      ,
          "市"  
      ,
          "布"
      ,
          "帆"
      ,
          "希"
      ,
          "帚"
      ,
          "帖"
      ,
          "帛"
      ,
          "帕"
      ,
          "帝"
      ,
          "帥"
      ,
          "席"
      ,
          "師"
      ,
          "帳"
      ,
          "常"
      ,
          "帷"
      ,
          "幅"
      ,
          "帽"
      ,
          "幣"
      ,
          "幕"
      ,
          "幢"
      ,
          "幟"
      ,
          "幫"
      ,
          "帶"
      ],
       "干":[
          "干"
      ,
          "平"  
      ,
          "并"
      ,
          "年"
      ,
          "幹"
      ,
          "幸"
      ],
       "幺":[
          "幻"
      ,
          "幼"  
      ,
          "幽"
      ,
          "幾"
      ],
       "廴":[
          "廷"
      ,
          "延"  
      ,
          "建"
      ],
      "廾":[
          "廿"
      ,
          "弄"  
      ,
          "弈"
      ,
          "弊"
      ],
      "弋":[
          "式"
      ,
          "弒"  
      ],
      "彐":[
          "彗"
      ,
          "彙"  
      ],
       "彡":[
          "形"
      ,
          "彤"  
      ,
          "彦"
      ,
          "彬"
      ,
          "彩"
      ,
          "彭"
      ,
          "彰"
      ,
          "影"
      ],
       "户":[
          "户"
      ,
          "房"  
      ,
          "戾"
      ,
          "所"
      ,
          "扁"
      ,
          "扇"
      ,
          "扈"
      ,
          "扉"
      ],
        "支":[
          "支"
      ],
       "文":[
          "文"
      ,
          "斑"  
      ,
          "斐"
      ,
          "斕"
      ],
       "斗":[
          "斗"
      ,
          "料"  
      ,
          "斜"
      ,
          "斡"
      ,
          "斟"
      ],
       "无":[
          "既"
      ],
       "殳":[
          "段"
      ,
          "殷"  
      ,
          "殺"
      ,
          "殼"
      ,
          "殿"
      ,
          "毅"
      ,
          "毀"
      ],
       "毋":[
          "毋"
      ,
          "母"  
      ,
          "每"
      ,
          "毒"
      ,
          "毓"
      ],
       "比":[
          "比"
      ,
          "毗"  
      ],
       "毛":[
          "毛"
      ,
          "毫"  
      ,
          "毯"
      ,
          "毽"
      ,
          "氈"
      ],
       "氏":[
          "氏"
      ,
          "民"  
      ,
          "氐"
      ,
          "氓"
      ],
       "爪":[
          "爪"
      ,
          "爬"  
      ,
          "爭"
      ,
          "爰"
      ,
          "爵"
      ],
      "父":[
          "父"
      ,
          "爸"  
      ,
          "爹"
      ,
          "爺"
      ],
       "爿":[
          "牀"
      ,
          "牆"  
      ],
      "片":[
          "片"
      ,
          "版"  
      ,
          "牘"
      ,
          "牌"
      ,
          "牒"
      ],
        "牙":[
          "牙"
      ],
        "玄":[
          "玄"
      ,
          "率"  
      ],
      "玉":[
          "巾"
      ,
          "玖"  
      ,
          "玟"
      ,
          "玩"
      ,
          "玫"
      ,
          "珊"
      ,
          "玻"
      ,
          "玲"
      ,
          "珍"
      ,
          "珀"
      ,
          "班"
      ,
          "珮"
      ,
          "珠"
      ,
          "球"
      ,
          "理"
      ,
          "現"
      ,
          "琺"
      ,
          "琳"
      ,
          "琢"
      ,
          "琵"
      ,
          "琴"
      ,
          "瑕"
      ,
          "瑪"
      ,
          "璃"
      ,
          "瑩"
      ,
          "璧"
      ,
          "璨"
      ,
          "璽"
      ,
          "瑣"
      ],
      "瓜":[
          "瓜"
      ,
          "瓠"  
      ,
          "瓢"
      ,
          "瓣"
      ],
      "瓦":[
          "瓦"
      ,
          "瓶"  
      ,
          "甄"
      ,
          "甌"
      ,
          "瓷"
      ],
      "甘":[
          "甘"
      ,
          "甚"  
      ,
          "甜"
      ],
      "生":[
          "生"
      ,
          "產"  
      ,
          "甦"
      ,
          "甥"
      ],
      "用":[
          "用"
      ,
          "甩"  
      ,
          "甬"
      ,
          "甫"
      ],
       "疋":[
          "疋"
      ,
          "疏"  
      ,
          "甜"
      ],
      "癶":[
          "癸"
      ,
          "登"  
      ,
          "發"
      ],
      "白":[
          "白"
      ,
          "百"  
      ,
          "皂"
      ,
          "的"
      ,
          "皇"
      ,
          "皆"
      ,
          "皈"
      ,
          "皎"
      ,
          "皖"
      ,
          "皓"
      ,
          "皚"
      ],
       "皮":[
          "皮"
      ,
          "皰"  
      ,
          "皴"
      ,
          "皺"
      ],
      "矛":[
          "矛"
      ,
          "矜"  
      ],
       "矢":[
          "矢"
      ,
          "矣"  
      ,
          "知"
      ,
          "短"  
      ,
          "矮"
      ,
          "矯"
      ,
          "矩"
      ],
       "禹":[
          "禹"
      ,
          "萬"  
      ,
          "禽"
      ],
      "立":[
          "立"
      ,
          "站"  
      ,
          "童"
      ,
          "竣"  
      ,
          "竭"
      ,
          "端"
      ,
          "競"
      ],
      "缶":[
          "缶"
      ,
          "缸"  
      ,
          "缺"
      ,
          "钵"  
      ,
          "罄"
      ,
          "罈"
      ,
          "罐"
      ],
       "网":[
          "罕"
      ,
          "罔"  
      ,
          "置"
      ,
          "署"  
      ,
          "罩"
      ,
          "罪"
      ,
          "罵"
      ,
          "罷"
      ,
          "罹"
      ,
          "羅"
      ,
          "罰"
      ],
      "老":[
          "老"
      ,
          "考"  
      ,
          "者"
      ,
          "耆"  
      ],
      "而":[
          "而"
      ,
          "耐"  
      ,
          "耍"
      ,
          "耆"  
      ],
      "耒":[
          "耕"
      ,
          "耕"  
      ,
          "耙"
      ,
          "耙"
      ,
          "耜"  
      ],
       "聿":[
          "肄"
      ,
          "肅"  
      ,
          "肇"
      ],
       "臣":[
          "臣"
      ,
          "卧"  
      ,
          "臧"
      ,
          "臨"  
      ],
        "自":[
          "自"
      ,
          "臭"  
      ],
       "至":[
          "至"
      ,
          "致"  
      ,
          "臻"
      ],
      "臼":[
          "臼"
      ,
          "臾"  
      ,
          "舀"
      ,
          "舂"  
      ,
          "舅"
      ,
          "與"
      ,
          "興"
      ,
          "舉"
      ,
          "舊"
      ],
       "舌":[
          "舌"
      ,
          "舍"  
      ,
          "舐"
      ,
          "舒"  
      ,
          "舔"
      ,
          "舖"
      ],
        "舛":[
          "堯"
      ,
          "舞"  
      ],
      "舟":[
          "舟"
      ,
          "航"  
      ,
          "舫"
      ,
          "舢"  
      ,
          "舵"  
      ,
          "舷"  
      ,
          "舶"  
      ,
          "船"  
      ,
          "艇"  
      ,
          "艦"  
      ,
          "舨"
      ,
          "般"
      ],
       "艮":[
          "艮"
      ,
          "良"  
      ,
          "艱"
      ],
       "色":[
          "色"
      ],
       "虍":[
          "虎"
      ,
          "虐"  
      ,
          "虔"
      ,
          "處"  
      ,
          "彪"  
      ,
          "虛"  
      ,
          "虞"  
      ,
          "虜"  
      ,
          "號"  
      ,
          "虧"  
      ],
       "血":[
          "血"
      ],
      "襾":[
          "西"
      ,
          "要"  
      ,
          "覃"
      ,
          "覆"  
      ],
      "角":[
          "角"
      ,
          "解"  
      ,
          "觴"
      ,
          "觸"  
      ],
      "谷":[
          "谷"
      ,
          "豁"  
      ,
          "谿"
      ],
       "豆":[
          "豆"
      ,
          "豈"  
      ,
          "豉"
      ,
          "豎"
      ,
          "豐"
      ,
          "豔"
      ,
          "豌"  
      ],
       "豸":[
          "豺"
      ,
          "豹"  
      ,
          "貂"
      ,
          "貉"
      ,
          "貌"
      ,
          "貓"
      ],
       "赤":[
          "赤"
      ,
          "赧"  
      ,
          "赦"
      ,
          "赫"
      ,
          "赭"
      ],
       "走":[
          "走"
      ,
          "赴"  
      ,
          "赳"
      ,
          "起"
      ,
          "超"
      ,
          "趙"
      ,
          "趕"
      ,
          "趣"
      ,
          "趟"
      ,
          "趨"
      ,
          "越"
      ],
       "身":[
          "身"
      ,
          "躬"  
      ,
          "躲"
      ,
          "躺"
      ,
          "軀"
      ],
      "辛":[
          "辛"
      ,
          "辜"  
      ,
          "辟"
      ,
          "辣"
      ,
          "辦"
      ,
          "辨"
      ,
          "辭"
      ,
          "辯"
      ],
        "辰":[
          "辰"
      ,
          "辱"  
      ,
          "農"
      ],
       "里":[
          "里"
      ,
          "重"  
      ,
          "野"  
      ,
          "量"  
      ,
          "釐"
      ],
      "采":[
          "采"
      ,
          "釉"  
      ,
          "釋"
      ],
      "長":[
          "長"
      ],
       "隶":[
          "隸"
      ],
       "青":[
          "青"
      ,
          "靖"  
      ,
          "靚"  
      ,
          "靛"  
      ,
          "靜"
      ],
       "非":[
          "非"
      ,
          "靠"  
      ,
          "靡"
      ],
       "面":[
          "面"
      ,
          "靦"  
      ,
          "靨"
      ],
      "革":[
          "革"
      ,
          "靶"  
      ,
          "靴"  
      ,
          "靼"  
      ,
          "鞅"  
      ,
          "鞍"  
      ,
          "鞋"  
      ,
          "鞏"  
      ,
          "鞘"  
      ,
          "鞠"  
      ,
          "鞣"  
      ,
          "鞭"  
      ,
          "韁"  
      ,
          "鞦"  
      ,
          "韆"
      ],
       "韋":[
          "韋"
      ,
          "韌"  
      ,
          "靚"  
      ,
          "韜"
      ],
       "韭":[
          "韭"
      ],
        "音":[
          "音"
      ,
          "章"  
      ,
          "竟"  
      ,
          "韶"
      ,
          "韻" 
      ,
          "響"
      ],
        "風":[
          "風"
      ,
          "颯"  
      ,
          "颱"  
      ,
          "颳"
      ,
          "颶" 
      ,
          "颼" 
      ,
          "飄" 
      ,
          "颺"
      ],
      "飛":[
          "飛"
      ],
       "首":[
          "首"
      ],
       "香":[
          "香"
      ,
          "馥"  
      ,
          "馨"  
      ],
      "骨":[
          "骨"
      ,
          "骯"  
      ,
          "骰"  
      ,
          "骷"
      ,
          "骸" 
      ,
          "骼" 
      ,
          "髏" 
      ,
          "髓" 
      ,
          "體" 
      ,
          "髒"
      ],
      "高":[
          "高"
      ],
      "髟":[
          "髦"
      ,
          "髮"  
      ,
          "髯"  
      ,
          "髻"
      ,
          "髭" 
      ,
          "鬃" 
      ,
          "鬆" 
      ,
          "鬍" 
      ,
          "鬚" 
      ,
          "鬢"
      ],
      "鬥":[
          "鬥"
      ,
          "鬧"  
      ],
      "鬯":[
          "鬱"
      ],
      "鬼":[
          "鬼"
      ,
          "魁"  
      ,
          "魂"  
      ,
          "魅"
      ,
          "魄" 
      ,
          "魏" 
      ,
          "魔" 
      ,
          "魘" 
      ],
       "魚":[
          "魚"
      ,
          "魷"  
      ,
          "魯"  
      ,
          "鮑"
      ,
          "鮮" 
      ,
          "鮫" 
      ,
          "鯊" 
      ,
          "鯉" 
      ,
          "鯨" 
      ,
          "鰓" 
      ,
          "鰭" 
      ,
          "鰥" 
      ,
          "鰱" 
      ,
          "鰾" 
      ,
          "鰻" 
      ,
          "鳝" 
      ,
          "鱗" 
      ,
          "鱖" 
      ,
          "鯽" 
      ],
       "鹵":[
          "鹵"
      ,
          "鹹"  
      ,
          "鹼"  
      ,
          "鹽"  
      ],
      "鹿":[
          "鹿"
      ,
          "麋"  
      ,
          "麒"  
      ,
          "麟"
      ,
          "麗" 
      ,
          "麓" 
      ,
          "麝" 
      ],
      "麥":[
          "麥"
      ,
          "麪"  
      ,
          "麩"  
      ,
          "麴"  
      ],
      "麻":[
          "麻"
      ,
          "麼"  
      ,
          "麾"  
      ],
       "黃":[
          "黃"
      ],
      "黍":[
          "黍"
      ,
          "黎"  
      ,
          "黏"  
      ],
       "黑":[
          "黑"
      ,
          "墨"  
      ,
          "默"  
      ,
          "黔"
      ,
          "點" 
      ,
          "黜" 
      ,
          "黝" 
      ,
          "黛" 
      ,
          "黠" 
      ,
          "黨" 
      ,
          "黯" 
      ,
          "黴" 
      ,
          "黷" 
      ],
      "黽":[
          "鳖"
      ,
          "鳌"  
      ],
      "鼎":[
          "鼎"
      ],
       "鼓":[
          "鼓"
      ,
          "鼕"  
      ,
          "鼙"  
      ],
      "鼠":[
          "鼠"
      ,
          "鼬"  
      ,
          "鼴"  
      ],
      "鼻":[
          "鼻"
      ,
          "鼾"  
      ],
       "齊":[
          "齊"
      ,
          "齋"  
      ],
       "齒":[
          "齒"
      ,
          "齟"  
      ,
          "齣"  
      ,
          "齡"
      ,
          "齦" 
      ,
          "齬" 
      ,
          "齪" 
      ,
          "齷" 
      ,
          "齲" 
      ],
      "龍":[
          "龍"
      ,
          "龔"  
      ],
       "龜":[
          "龜"
      ],
       "龠":[
          "龠"
      ,
          "龢"
      ,
          "龤"
      ,
          "龡"  
      ]
 }


 public radical1=[  //1畫
    {label:'一', value:'一'},
    {label:'丨', value:'丨'},
    {label:'丶', value:'丶'},
    {label:'丿', value:'丿'},
    {label:'乙', value:'乙'},
    {label:'亅', value:'亅'}
  ]
  public radical2=[  //2畫
    {label:'人', value:'人'},
    {label:'刀', value:'刀'},
    {label:'二', value:'二'},
    {label:'八', value:'八'},
    {label:'又', value:'又'},
    {label:'亠', value:'亠'},
    {label:'儿', value:'儿'},
    {label:'入', value:'入'},
    {label:'冖', value:'冖'},
    {label:'冂', value:'冂'},
    {label:'冫', value:'冫'},
    {label:'几', value:'几'},
    {label:'勹', value:'勹'},
    {label:'匕', value:'匕'},
    {label:'匸', value:'匸'},
    {label:'匚', value:'匚'},
    {label:'十', value:'十'},
    {label:'卜', value:'卜'},
    {label:'卩', value:'卩'},
    {label:'厂', value:'厂'},
    {label:'厶', value:'厶'},
    {label:'力', value:'力'}
  ]
  public radical3=[  //3畫
    {label:'口', value:'口'},
    {label:'宀', value:'宀'},
    {label:'土', value:'土'},  
    {label:'子', value:'子'},
    {label:'寸', value:'寸'},
    {label:'尸', value:'尸'},
    {label:'山', value:'山'},
    {label:'弓', value:'弓'},
    {label:'夕', value:'夕'},
    {label:'大', value:'大'},
    {label:'女', value:'女'},
    {label:'彳', value:'彳'},
    {label:'氵', value:'氵'},
    {label:'囗', value:'囗'},
    {label:'士', value:'士'},
    {label:'夂', value:'夂'},
    {label:'小', value:'小'},
    {label:'尢', value:'尢'},
    {label:'屮', value:'屮'},
    {label:'巛', value:'巛'},
    {label:'工', value:'工'},
    {label:'己', value:'己'},
    {label:'巾', value:'巾'},
    {label:'干', value:'干'},
    {label:'幺', value:'幺'},
    {label:'廴', value:'廴'},
    {label:'廾', value:'廾'},
    {label:'弋', value:'弋'},
    {label:'彐', value:'彐'},
    {label:'彡', value:'彡'},
    {label:'辶', value:'辶'}
  ]
  public radical4=[  //4畫
    {label:'攵', value:'攵'},
    {label:'心(忄)', value:'心'},
    {label:'戈', value:'戈'},
    {label:'手(扌)', value:'手'},
    {label:'攴', value:'攴'},
    {label:'斤', value:'斤'},
    {label:'方', value:'方'},
    {label:'日', value:'日'},
    {label:'月', value:'月'},
    {label:'木', value:'木'},
    {label:'欠', value:'欠'},
    {label:'止', value:'止'},
    {label:'歹', value:'歹'},
    {label:'气', value:'气'},
    {label:'水', value:'水'},
    {label:'户', value:'户'},
    {label:'支', value:'支'},
    {label:'文', value:'文'},
    {label:'斗', value:'斗'},
    {label:'无', value:'无'},
    {label:'殳', value:'殳'},
    {label:'毋', value:'毋'},
    {label:'比', value:'比'},
    {label:'毛', value:'毛'},
    {label:'氏', value:'氏'},
    {label:'爪', value:'爪'},
    {label:'父', value:'父'},
    {label:'爿', value:'爿'},
    {label:'片', value:'片'},
    {label:'牙', value:'牙'},
    {label:'火(灬)', value:'火'},
    {label:'牛(牜)', value:'牛'},
    {label:'犬(犭)', value:'犬'}]
    
    public radical5=[  //5畫
        {label:'歺', value:'歺'},
        {label:'田', value:'田'},
        {label:'疒', value:'疒'},
        {label:'皿', value:'皿'},
        {label:'目(罒)', value:'目'},
        {label:'石(示)', value:'石'},
        {label:'礻', value:'礻'},
        {label:'禾', value:'禾'},
        {label:'玄', value:'玄'},
        {label:'玉', value:'玉'},
        {label:'瓜', value:'瓜'},
        {label:'瓦', value:'瓦'},
        {label:'甘', value:'甘'},
        {label:'生', value:'生'},
        {label:'用', value:'用'},
        {label:'疋', value:'疋'},
        {label:'癶', value:'癶'},
        {label:'白', value:'白'},
        {label:'皮', value:'皮'},
        {label:'矛', value:'矛'},
        {label:'矢', value:'矢'},
        {label:'禹', value:'禹'},
        {label:'立', value:'立'},
        {label:'穴', value:'穴'},
      ]
      public radical6=[  //6畫
        {label:'竹', value:'竹'},
        {label:'耳', value:'耳'},
        {label:'頁', value:'頁'},
        {label:'虫', value:'虫'},
        {label:'肉', value:'肉'},
        {label:'衣', value:'衤'},
        {label:'羊', value:'羊'},
        {label:'⺿(艸)', value:'艸'},
        {label:'缶', value:'缶'},
        {label:'羽', value:'羽'},
        {label:'网', value:'网'},
        {label:'老', value:'老'},
        {label:'而', value:'而'},
        {label:'耒', value:'耒'},
        {label:'聿', value:'聿'},
        {label:'臣', value:'臣'},
        {label:'自', value:'自'},
        {label:'至', value:'至'},
        {label:'臼', value:'臼'},
        {label:'舌', value:'舌'},
        {label:'舛', value:'舛'},
        {label:'舟', value:'舟'},
        {label:'艮', value:'艮'},
        {label:'色', value:'色'},
        {label:'虍', value:'虍'},
        {label:'血', value:'血'},
        {label:'襾', value:'襾'},
        {label:'糸', value:'糸'},
      ]
      public radical7=[  //7畫
        {label:'車', value:'車'},
        {label:'酉', value:'酉'},
        {label:'豕', value:'豕'},
        {label:'貝', value:'貝'},
        {label:'見', value:'見'},
        {label:'足(⻊)', value:'足'},
        {label:'⻏(邑)', value:'⻏'},
        {label:'角', value:'角'},
        {label:'辵', value:'辵'},
        {label:'谷', value:'谷'},
        {label:'豸', value:'豸'},
        {label:'赤', value:'赤'},
        {label:'走', value:'走'},
        {label:'身', value:'身'},
        {label:'辛', value:'辛'},
        {label:'辰', value:'辰'},
        {label:'采', value:'采'},
        {label:'里', value:'里'},
        {label:'言(讠)', value:'言'},
      ]
      public radical8=[  //8畫
        {label:'雨', value:'雨'},
        {label:'隹', value:'隹'},
        {label:'阝(阜)', value:'阝'},
        {label:'金(钅)', value:'金'},
        {label:'門', value:'門'},
        {label:'長', value:'長'},
        {label:'隶', value:'隶'},
        {label:'青', value:'青'},
        {label:'非', value:'非'}
      ]
      public radical9=[  //9畫
        {label:'頁', value:'頁'},
        {label:'面', value:'面'},
        {label:'革', value:'革'},
        {label:'韋', value:'韋'},
        {label:'韭', value:'韭'},
        {label:'風', value:'風'},
        {label:'音', value:'音'},
        {label:'飛', value:'飛'},
        {label:'首', value:'首'},
        {label:'香', value:'香'},
        {label:'食(飠)', value:'食'}
      ]
      public radical10=[  //10畫
        {label:'馬', value:'馬'},
        {label:'骨', value:'骨'},
        {label:'高', value:'高'},
        {label:'髟', value:'髟'},
        {label:'鬥', value:'鬥'},
        {label:'鬯', value:'鬯'},
        {label:'鬼', value:'鬼'}
      ]
      public radical11=[  //11畫
        {label:'鳥', value:'鳥'},
        {label:'魚', value:'魚'},
        {label:'鹵', value:'鹵'},
        {label:'鹿', value:'鹿'},
        {label:'麥', value:'麥'},
        {label:'麻', value:'麻'}
      ]
      public radical12=[  //12畫
        {label:'黃', value:'黃'},
        {label:'黍', value:'黍'},
        {label:'黑', value:'黑'}
      ]
      public radical13=[  //13畫
        {label:'黽', value:'黽'},
        {label:'鼎', value:'鼎'},
        {label:'鼓', value:'鼓'},
        {label:'鼠', value:'鼠'}
      ]
      public radical14=[  //14畫
        {label:'鼻', value:'鼻'},
        {label:'齊', value:'齊'}
      ]
      public radical15=[  //15畫
        {label:'齒', value:'齒'}
      ]
      public radical16=[  //16畫
        {label:'龍', value:'龍'},
        {label:'龜', value:'龜'}
      ]
      public radical17=[  //18畫
        {label:'龠', value:'龠'}
      ]
  public blank = [];
  columnDefs = [
    { field: 'question_no', rowDrag: true, headerName: '', editable: false, lockPosition: true, suppressSizeToFit: true,cellClass: 'question_no', width: 60 },
    { headerName: '部首', field: 'question', editable: true, lockPosition: true, cellClass: 'question', suppressSizeToFit: true, width: 70,cellEditor:'selectEditorComponent', 
    cellEditorParams: {       
        values: [
          this.radical1,
          this.radical2,
          this.radical3,
          this.radical4,
          this.radical5,
          this.radical6,
          this.radical7,
          this.radical8,
          this.radical9,
          this.radical10,
          this.radical11,
          this.radical12,
          this.radical13,
          this.radical14,
          this.radical15,
          this.radical16,
          this.radical17,
        ],stopEditing: (el,event)=>{ this.closeSelect(el);},
        onCellValueChanged: (e)=>{this.closeSelect(e);},
    },},
    { headerName: '字-詞組', field: 'answer1', editable: true, lockPosition: true, resizable: true,cellClass: 'cell-wrap-text',
     cellEditor: 'agLargeTextCellEditor' , cellEditorParams: {maxLength: 1000},width: window.innerWidth - 164},
    { headerName: '', field: 'remove', lockPosition: true, cellRenderer: 'removeButtonComponent',suppressSizeToFit: true, width: 34 },
  ]
  rowClassRules = {
      
    'contain-error': function (params) {
        
      return params.data.changecolor(params) == 'wrong';
      
    }
    
  }
  closeSelect(e){
    
    
  }

onCellValueChanged(event) {
    this.gridApi.sizeColumnsToFit();
    
    let z=document.getElementsByClassName("drop-down");
    while(z.length>0){
        z[0].parentNode.removeChild(z[0]);
    }

    
    if(event.colDef.field =='question')
    {
    for(let key in this.db_array)
    {
        if (key === event.newValue )
        {
           this.rowData[event.rowIndex]['answer1']= String(this.db_array[key]);
           
           this.wrong=1;
           this.gridApi.refreshCells();
        }  
    }

    if(this.wrong==0 && event.newValue  !='')
    {
          
        let lang = this.lang;
        this.text = lang == 'b5' ? '沒有此部首.' : 'No such radical.';
 
    }else{
    this.wrong=0;
    this.text = "";
    }
    }

    if(event.colDef.field =='answer1')
    {
        this.blank = event.newValue.split(",");

        for(let comma in this.blank)
        {
            
            if(this.blank[comma] =="" )
            {          
                this.text = "";
                this.check +=1;
            }
            if(this.blank[comma].length>1)
            {
                this.check=0;
                let lang = this.lang;
                this.text = lang == 'b5' ? '字-詞語格式不正確.請以例如“仁,偉”這樣的格式輸入' : 'The character-word format is incorrect. Please follow this eg "仁,偉".';
            }
        
        }
        if(this.check >0 && event.newValue  !='')
        {    
                this.check=0;
                let lang = this.lang;
                this.text = lang == 'b5' ? '字-詞語格式不正確.請以例如“仁,偉”這樣的格式輸入' : 'The character-word format is incorrect. Please follow this eg "仁,偉".';
                
         
        }
        else{
            this.check=0;
        }
    }
    let row = this.gridApi.getDisplayedRowAtIndex(event.rowIndex);
    this.gridApi.redrawRows({ rowNodes: [row] });
  }

constructor(public dataService: DataService, public storage: StorageService, public device: DeviceDetectorService, public router: Router, protected modal: ModalService, protected common: CommonService, protected ngZone: NgZone,private ro: RoService,public api:ApiService) {
    if(this.storage.buy ==0)
    {
        this.style = {
        width: '100%',
        height: '240px',
        flex: '1 1 auto'
    };
}
    this.lang = api.lang || 'b5';
    this.rowData = dataService.rowData;
    this.deviceInfo = device.getDeviceInfo();
    this.isMobile = (device.isMobile() || device.isTablet()) && device.os.toLowerCase() != 'windows';
}
  ngOnInit() {   
    this.api.getgame(['ROWebGame.get_game_name', this.api.dataId]).subscribe((data :any )=> {
        console.log(data);
        let gameid = data.game.key.split('/');
        let find = this.gamelist.find(e=>e.id == gameid[1])
        if(find){
          this.gamename = find.name;
          this.gamename_en = find.name_en;
          console.log(this.gamename)
        }
        this.common.clearAllLoading();
     })
    setTimeout(() => {this.common.addLoading('grid');},100);
    setTimeout(() => {
      window.location.hash = '#ro/ready';
    }, 500);
    let lang = this.lang;
    this.columnDefs[1]['headerName'] = lang == 'b5' ? '部首' : 'Radical';
    this.columnDefs[2]['headerName'] = lang == 'b5' ? '字-詞組' : 'Character-word';
 
    if (this.api.readonly == 'true' || this.api.readonly == '1') {
      this.columnDefs[0]['rowDrag'] = false;
      this.columnDefs[0]['cellClass'] = 'question_no readonly';
      if (this.deviceInfo.browser_version == '7.0') {
        this.columnDefs.forEach((col) => {
          col['cellClass'] = col['cellClass'] + 'ie7';
        })
      }
      for (let i = 1; i <= 6; i++) {
        this.columnDefs[i]['editable'] = false;
      }
    }

    window['save'] = window['save'] || {};
    window['save'] = this.outsideSave.bind(this);
  }

  onGridReady(params) {
    this.gridApi = params.api;
    this.gridColumnApi = params.columnApi;
    this.api.getgame(['ROWebGame.get_buy_game', this.storage.jwtObj.school_id]).subscribe((data :any )=> {
        console.log(data.game);
        
        if(data.game.addon_function == 'SWLP game')
        {
          this.storage.buy=1;
        }
        else{
          this.storage.buy = 0;
        }
        this.common.removeLoading('gameaddon')
      
    this.dataService.setData(() => {
      let rows = this.rowData;
      this.gridApi.setRowData(rows);
      
      this.common.removeLoading('grid');
    });
    })
  }

  onRowDragEnd($event) {
    let rows = this.rowData;
    let newId = $event.node.rowIndex;
    let data = $event.node.data;
    data.question_no = (newId + 1 > data.question_no ? newId + 1.5 : newId + 0.5);
    rows = rows.sort((a, b) => a.question_no >= b.question_no ? 1 : -1);
    this.updateIndex();
    this.gridApi.setRowData(rows);
  }

  onClickUpdate() {
    window.location.hash = '#ro/saving';
    this.common.addLoading('saving');
    this.gridApi.stopEditing(false);
    setTimeout(() => {
      if (this.modalError()) {
        this.common.removeLoading('saving');
        return false;
      }
      this.redrawData();
      this.dataService.saveData().subscribe(
        (res:any) => {
          if (res.body.id) {
            setTimeout(() => {
              window.location.hash = '#ro/close';
            }, 500);
          } else {
            this.common.removeLoading('saving');
            this.modal.create({
              type: 'alert',
              message: this.lang == 'b5' ? '網絡異常' : 'Network Error'
            });
          }
        },
        (error) => {
          this.common.removeLoading('saving');
          this.modal.create({
            type: 'alert',
            message: this.lang == 'b5' ? '網絡異常' : 'Network Error'
          });
        });
    }, 100);
  }

  importClick(){
    let lowDevice = this.device.os.toLowerCase();
    if (this.device.isTablet() || this.device.isMobile()){
      this.modal.create({
        type: 'alert',
        message: this.lang == 'b5' ? '請使用Windows或Mac版上載或匯出題目Excel。' : ' Please use Windows or Mac version to upload or export question excel.'
      });
    } else if (lowDevice == 'mac'){
      this.macImport();
    } else {
      this.fileInput.nativeElement.click();
    }
  }
  pcImport(evt: any) { //disabled
    console.log("pcImport");
    this.gridApi.stopEditing(false);
    const target: DataTransfer = <DataTransfer>(evt.target);
    if (target.files.length !== 1) {
      this.modal.create({
        type: 'alert',
        message: this.lang == 'b5' ? '只能選擇一個檔案' : 'Cannot use multiple files'
      });
      return false;
    }
    let filename = target.files[0].name;
    if (filename.lastIndexOf('.xls') < filename.length - 5) {
      this.modal.create({
        type: 'alert',
        message: this.lang == 'b5' ? '檔案只接受xls或xlsx' : 'only xls or xlsx file are accepted.'
      });
      return false;
    }
    if (/\s/.test(filename)) {
      this.modal.create({
        type: 'alert',
        message: this.lang == 'b5' ? '檔案名格式不可有空格。' : 'Filename cannot have space.'
      });
      return false;
    }
    this.loadXlsx(target.files[0]);
  }

  macImport(){
    this.ro.request("browse", {
        filter: ['xlsx'],
      }).then((data)=>{
        setTimeout(()=>{
          this.dataService.getXlsx(data.url).subscribe((res:any)=>{
            this.loadXlsx(res);
          },(err)=>{
            this.modal.create({
              type: 'alert',
              message: JSON.stringify(err)
            });
          });
        },300);
      },(err)=>{
        if (err != 'cancel'){
          this.modal.create({
            type: 'alert',
            message: JSON.stringify(err)
          });
        }
      });
  }

  loadXlsx(file){
    console.log("loadxlsx");
    this.common.addLoading('importing');
    const reader: FileReader = new FileReader();
    reader.onload = (e: any) => {
      
      let binary = "";
      let bytes = new Uint8Array(e.target.result);
      let length = bytes.byteLength;
      for (let i = 0; i < length; i++) {
        binary += String.fromCharCode(bytes[i]);
      }
      var wb = XLSX.read(binary, { type: 'binary', cellDates: true, cellStyles: true });

      const wsname: string = wb.SheetNames[0];
      const ws: XLSX.WorkSheet = wb.Sheets[wsname];
      let importedData = <AOA>(XLSX.utils.sheet_to_json(ws, { header: 1 }));
      let importedRows = this.dataService.importData(importedData);
      this.gridApi.setRowData(this.rowData);
      if (importedRows > 150) {
        this.modal.create({
          type: 'alert',
          message: this.lang == 'b5' ? '你的檔案題目多於150題，系統只會匯入首150題。' : 'Your file contains more than 150 questions, only first 150 questions will be imported.'
        });
      }
      this.common.removeLoading('importing');
    };
    reader.readAsArrayBuffer(file);
  }

  onExport() {
    if (this.device.isTablet() || this.device.isMobile()){
        this.modal.create({
          type: 'alert',
          message: this.lang == 'b5' ? '請使用Windows或Mac版上載或匯出題目Excel。' : ' Please use Windows or Mac version to upload or export question excel.'
        });
        return false;
      }
    this.gridApi.stopEditing(false);
    setTimeout(() => {
      if (this.modalError()) {
        return false;
      }
      console.log('game name: '+this.gamename)
      let exportData = this.dataService.rowData2Array();
      let lowDevice = this.device.os.toLowerCase();
      if (lowDevice == 'mac'){
        this.ro.request("exportXLSX", {
            filename: this.gamename+'.xlsx',
            sheetName: this.gamename,
            data: exportData
          }).then(()=>{
            this.redrawData();
          },(err)=>{
            if (err == 'Request Timeout.'){
              this.modal.create({
                type: 'alert',
                message: this.lang == 'b5' ? '舊版本不支援匯出, 請更新版本。' : 'Please upgrade RainbowOne to export file.'
              });
            } else if (err != 'cancel'){
              this.modal.create({
                type: 'alert',
                message: err
              });
            }
          });
      } else {
  
        const ws: XLSX.WorkSheet = XLSX.utils.aoa_to_sheet(exportData);
        const wb: XLSX.WorkBook = XLSX.utils.book_new(); `Please`
        XLSX.utils.book_append_sheet(wb, ws, this.gamename);
        XLSX.writeFile(wb, this.gamename+'.xlsx');
        this.redrawData();
      }
    }, 100);
  }

  onTouchmove($event) {
    if ($event.top <= 0)
      $event.top = 0;
  }

  modalError() {
    let error = this.rowData.find((ele) => ele.validColumn() == 'missing');
    if (error) {
      let message = this.lang == 'b5' ? '部分題目欠缺資料，請更正。' : 'Some questions has missing data, please correct.';
      this.modal.create({
        message: message, type: 'alert', execAfter: () => {
          this.gridApi.ensureIndexVisible(error.question_no - 1, 'middle');
        }
      });
      return true;
    }
    let atLeastOne = this.rowData.find((ele) => ele.validColumn() == 'complete');
    if (!atLeastOne) {
      let message = this.lang == 'b5' ? '請輸入最少一條題目。' : 'Please at least input one question.';
      this.modal.create({ message: message, type: 'alert', execAfter: () => { } });
      return true;
    }
    let err = this.rowData.find( (ele) => ele.checkcolor(ele) == 'wrong');
    if (err) {
      let message = this.lang == 'b5' ? '部分題目輸入不正確，請更正。' : 'Some questions input is incorrect, please correct.';
      this.modal.create({
        message: message, type: 'alert', execAfter: () => {
         
        }
      });
      return true;
    }
    /*let change =  this.device.isTablet() || this.device.isMobile() || true;
    if (change) {
        let message = this.lang == 'b5' ? '請使用Windows或Mac版上載或匯出題目Excel。' : ' Please use Windows or Mac version to upload or export question excel.';
        this.modal.create({
          message: message, type: 'alert', execAfter: () => {
            this.gridApi.ensureIndexVisible(error.question_no - 1, 'middle');
          }
        });
        return true;
      }*/
    return false;
  }

  gridResize($event) {
    this.columnDefs[2].width = window.innerWidth - 164;
    this.gridApi.setColumnDefs();
    this.gridApi.setColumnDefs(this.columnDefs);
  }

  updateIndex() {
    let rows = this.rowData;
    this.rowData.forEach((row) => {
      row.question_no = rows.indexOf(row) + 1;
    });
  }

  outsideSave() {
    this.ngZone.run(() => {
      setTimeout(() => {
        this.onClickUpdate()
      }, 500);
    });
  }

  redrawData() {
    this.dataService.mergeData();
    let rows = this.rowData;
    this.updateIndex();
    this.gridApi.setRowData(rows);
  }



}